[Killed] LogicalOperator
src/adapters/author-action.ts:8:60
 type Payload = Record<string, unknown>;
 type Handler = (store: GaotaiStore, p: Payload) => unknown;
 
-const asString = (value: unknown, fallback = "") => String(value || fallback);
+const asString = (value: unknown, fallback = "") => String(value && fallback);
 
 const HANDLERS: Record<string, Handler> = {
killedBy: author-action adapter falls back empty names and keeps unknown ops rejected
statusReason: expected '' to be '未命名 Board' // Object.is equality

[Killed] ConditionalExpression
src/adapters/author-action.ts:8:60
 type Payload = Record<string, unknown>;
 type Handler = (store: GaotaiStore, p: Payload) => unknown;
 
-const asString = (value: unknown, fallback = "") => String(value || fallback);
+const asString = (value: unknown, fallback = "") => String(true);
 
 const HANDLERS: Record<string, Handler> = {
killedBy: runAuthorAction dispatches known actions and rejects unknown ones
statusReason: expected 'true' to be 'Chaos' // Object.is equality

[Killed] ArrowFunction
src/adapters/author-action.ts:11:16
 const asString = (value: unknown, fallback = "") => String(value || fallback);
 
 const HANDLERS: Record<string, Handler> = {
-  createBoard: (store, p) => store.createBoard(asString(p.name, "未命名 Board")),
+  createBoard: () => undefined,
   renameBoard: (store, p) => store.renameBoard(asString(p.id), asString(p.name)),
   deleteBoard: (store, p) => {
killedBy: runAuthorAction dispatches known actions and rejects unknown ones
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] ArrowFunction
src/adapters/author-action.ts:12:16
 
 const HANDLERS: Record<string, Handler> = {
   createBoard: (store, p) => store.createBoard(asString(p.name, "未命名 Board")),
-  renameBoard: (store, p) => store.renameBoard(asString(p.id), asString(p.name)),
+  renameBoard: () => undefined,
   deleteBoard: (store, p) => {
     store.deleteBoard(asString(p.id));
killedBy: author-action adapter covers rename, delete, switch, link, write, and chat handlers
statusReason: expected undefined to match object { name: '' }

[Killed] BlockStatement
src/adapters/author-action.ts:13:30
 const HANDLERS: Record<string, Handler> = {
   createBoard: (store, p) => store.createBoard(asString(p.name, "未命名 Board")),
   renameBoard: (store, p) => store.renameBoard(asString(p.id), asString(p.name)),
-  deleteBoard: (store, p) => {
-    store.deleteBoard(asString(p.id));
-    return { ok: true };
-  },
+  deleteBoard: (store, p) => {},
   setCurrentBoard: (store, p) => {
     store.setCurrentBoard(asString(p.id));
killedBy: author-action adapter covers rename, delete, switch, link, write, and chat handlers
statusReason: expected undefined to deeply equal { ok: true }

[Killed] BooleanLiteral
src/adapters/author-action.ts:15:18
   renameBoard: (store, p) => store.renameBoard(asString(p.id), asString(p.name)),
   deleteBoard: (store, p) => {
     store.deleteBoard(asString(p.id));
-    return { ok: true };
+    return { ok: false };
   },
   setCurrentBoard: (store, p) => {
killedBy: author-action adapter covers rename, delete, switch, link, write, and chat handlers
statusReason: expected { ok: false } to deeply equal { ok: true }

[Killed] ObjectLiteral
src/adapters/author-action.ts:15:12
   renameBoard: (store, p) => store.renameBoard(asString(p.id), asString(p.name)),
   deleteBoard: (store, p) => {
     store.deleteBoard(asString(p.id));
-    return { ok: true };
+    return {};
   },
   setCurrentBoard: (store, p) => {
killedBy: author-action adapter covers rename, delete, switch, link, write, and chat handlers
statusReason: expected {} to deeply equal { ok: true }

[Killed] BlockStatement
src/adapters/author-action.ts:17:34
     store.deleteBoard(asString(p.id));
     return { ok: true };
   },
-  setCurrentBoard: (store, p) => {
-    store.setCurrentBoard(asString(p.id));
-    return { ok: true };
-  },
+  setCurrentBoard: (store, p) => {},
   addLink: (store, p) => store.addLink(asString(p.boardId), asString(p.url)),
   addLinks: (store, p) =>
killedBy: author-action adapter covers rename, delete, switch, link, write, and chat handlers
statusReason: expected undefined to deeply equal { ok: true }

[Killed] BooleanLiteral
src/adapters/author-action.ts:19:18
   },
   setCurrentBoard: (store, p) => {
     store.setCurrentBoard(asString(p.id));
-    return { ok: true };
+    return { ok: false };
   },
   addLink: (store, p) => store.addLink(asString(p.boardId), asString(p.url)),
killedBy: author-action adapter covers rename, delete, switch, link, write, and chat handlers
statusReason: expected { ok: false } to deeply equal { ok: true }

[Killed] ObjectLiteral
src/adapters/author-action.ts:19:12
   },
   setCurrentBoard: (store, p) => {
     store.setCurrentBoard(asString(p.id));
-    return { ok: true };
+    return {};
   },
   addLink: (store, p) => store.addLink(asString(p.boardId), asString(p.url)),
killedBy: author-action adapter covers rename, delete, switch, link, write, and chat handlers
statusReason: expected {} to deeply equal { ok: true }

[Killed] ArrowFunction
src/adapters/author-action.ts:21:12
     store.setCurrentBoard(asString(p.id));
     return { ok: true };
   },
-  addLink: (store, p) => store.addLink(asString(p.boardId), asString(p.url)),
+  addLink: () => undefined,
   addLinks: (store, p) =>
     parsePastedLinks(asString(p.text)).urls.map((url) => store.addLink(asString(p.boardId), url)),
killedBy: author-action adapter covers rename, delete, switch, link, write, and chat handlers
statusReason: Cannot read properties of undefined (reading 'title')

[Killed] ArrowFunction
src/adapters/author-action.ts:22:13
     return { ok: true };
   },
   addLink: (store, p) => store.addLink(asString(p.boardId), asString(p.url)),
-  addLinks: (store, p) =>
-    parsePastedLinks(asString(p.text)).urls.map((url) => store.addLink(asString(p.boardId), url)),
+  addLinks: () => undefined,
   addLocalFile: (store, p) =>
     store.addLocalFile(asString(p.boardId), asString(p.name), {
killedBy: author-action adapter adds pasted links, starts chat with a default title, and copies a file
statusReason: Target cannot be null or undefined.

[Killed] ArrowFunction
src/adapters/author-action.ts:23:49
   },
   addLink: (store, p) => store.addLink(asString(p.boardId), asString(p.url)),
   addLinks: (store, p) =>
-    parsePastedLinks(asString(p.text)).urls.map((url) => store.addLink(asString(p.boardId), url)),
+    parsePastedLinks(asString(p.text)).urls.map(() => undefined),
   addLocalFile: (store, p) =>
     store.addLocalFile(asString(p.boardId), asString(p.name), {
killedBy: author-action adapter covers rename, delete, switch, link, write, and chat handlers
statusReason: Cannot read properties of undefined (reading 'url')

[Killed] ArrowFunction
src/adapters/author-action.ts:24:17
   addLink: (store, p) => store.addLink(asString(p.boardId), asString(p.url)),
   addLinks: (store, p) =>
     parsePastedLinks(asString(p.text)).urls.map((url) => store.addLink(asString(p.boardId), url)),
-  addLocalFile: (store, p) =>
-    store.addLocalFile(asString(p.boardId), asString(p.name), {
-      mime: p.mime ? String(p.mime) : undefined,
-      dataUrl: p.dataUrl ? String(p.dataUrl) : undefined,
-      body: p.body ? String(p.body) : undefined,
-    }),
+  addLocalFile: () => undefined,
   addDocument: (store, p) =>
     store.addDocument(asString(p.boardId), asString(p.title, "未命名文档"), asString(p.body)),
killedBy: author-action adapter treats only outcome=failed as a failed transcription
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
src/adapters/author-action.ts:25:63
   addLinks: (store, p) =>
     parsePastedLinks(asString(p.text)).urls.map((url) => store.addLink(asString(p.boardId), url)),
   addLocalFile: (store, p) =>
-    store.addLocalFile(asString(p.boardId), asString(p.name), {
-      mime: p.mime ? String(p.mime) : undefined,
-      dataUrl: p.dataUrl ? String(p.dataUrl) : undefined,
-      body: p.body ? String(p.body) : undefined,
-    }),
+    store.addLocalFile(asString(p.boardId), asString(p.name), {}),
   addDocument: (store, p) =>
     store.addDocument(asString(p.boardId), asString(p.title, "未命名文档"), asString(p.body)),
killedBy: author-action adapter covers rename, delete, switch, link, write, and chat handlers
statusReason: expected '本地文档：notes.txt' to be '本地正文' // Object.is equality

[Killed] ArrowFunction
src/adapters/author-action.ts:30:16
       dataUrl: p.dataUrl ? String(p.dataUrl) : undefined,
       body: p.body ? String(p.body) : undefined,
     }),
-  addDocument: (store, p) =>
-    store.addDocument(asString(p.boardId), asString(p.title, "未命名文档"), asString(p.body)),
+  addDocument: () => undefined,
   updateFile: (store, p) =>
     store.updateFile(asString(p.id), {
killedBy: author-action adapter maps folderId null, missing, and a real id without wiping other fields
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ArrowFunction
src/adapters/author-action.ts:32:15
     }),
   addDocument: (store, p) =>
     store.addDocument(asString(p.boardId), asString(p.title, "未命名文档"), asString(p.body)),
-  updateFile: (store, p) =>
-    store.updateFile(asString(p.id), {
-      title: p.title !== undefined ? String(p.title) : undefined,
-      body: p.body !== undefined ? String(p.body) : undefined,
-      selected: typeof p.selected === "boolean" ? p.selected : undefined,
-      folderId: p.folderId === null ? null : p.folderId ? String(p.folderId) : undefined,
-    }),
+  updateFile: () => undefined,
   addHighlight: (store, p) => store.addHighlight(asString(p.fileId), asString(p.text)),
   toggleHighlight: (store, p) =>
killedBy: author-action adapter maps folderId null, missing, and a real id without wiping other fields
statusReason: expected 'folder-rhvd6c21-msraghsn' to be null

[Killed] EqualityOperator
src/adapters/author-action.ts:34:14
     store.addDocument(asString(p.boardId), asString(p.title, "未命名文档"), asString(p.body)),
   updateFile: (store, p) =>
     store.updateFile(asString(p.id), {
-      title: p.title !== undefined ? String(p.title) : undefined,
+      title: p.title === undefined ? String(p.title) : undefined,
       body: p.body !== undefined ? String(p.body) : undefined,
       selected: typeof p.selected === "boolean" ? p.selected : undefined,
killedBy: author-action adapter maps folderId null, missing, and a real id without wiping other fields
statusReason: expected 'undefined' to be '甲' // Object.is equality

[Killed] ConditionalExpression
src/adapters/author-action.ts:34:14
     store.addDocument(asString(p.boardId), asString(p.title, "未命名文档"), asString(p.body)),
   updateFile: (store, p) =>
     store.updateFile(asString(p.id), {
-      title: p.title !== undefined ? String(p.title) : undefined,
+      title: true ? String(p.title) : undefined,
       body: p.body !== undefined ? String(p.body) : undefined,
       selected: typeof p.selected === "boolean" ? p.selected : undefined,
killedBy: author-action adapter maps folderId null, missing, and a real id without wiping other fields
statusReason: expected 'undefined' to be '甲' // Object.is equality

[Killed] EqualityOperator
src/adapters/author-action.ts:35:13
   updateFile: (store, p) =>
     store.updateFile(asString(p.id), {
       title: p.title !== undefined ? String(p.title) : undefined,
-      body: p.body !== undefined ? String(p.body) : undefined,
+      body: p.body === undefined ? String(p.body) : undefined,
       selected: typeof p.selected === "boolean" ? p.selected : undefined,
       folderId: p.folderId === null ? null : p.folderId ? String(p.folderId) : undefined,
killedBy: author-action adapter covers rename, delete, switch, link, write, and chat handlers
statusReason: expected 'undefined' to be '' // Object.is equality

[Killed] ConditionalExpression
src/adapters/author-action.ts:35:13
   updateFile: (store, p) =>
     store.updateFile(asString(p.id), {
       title: p.title !== undefined ? String(p.title) : undefined,
-      body: p.body !== undefined ? String(p.body) : undefined,
+      body: true ? String(p.body) : undefined,
       selected: typeof p.selected === "boolean" ? p.selected : undefined,
       folderId: p.folderId === null ? null : p.folderId ? String(p.folderId) : undefined,
killedBy: author-action adapter covers rename, delete, switch, link, write, and chat handlers
statusReason: expected 'undefined' to be '' // Object.is equality

[Killed] EqualityOperator
src/adapters/author-action.ts:36:17
     store.updateFile(asString(p.id), {
       title: p.title !== undefined ? String(p.title) : undefined,
       body: p.body !== undefined ? String(p.body) : undefined,
-      selected: typeof p.selected === "boolean" ? p.selected : undefined,
+      selected: typeof p.selected !== "boolean" ? p.selected : undefined,
       folderId: p.folderId === null ? null : p.folderId ? String(p.folderId) : undefined,
     }),
killedBy: author-action adapter maps folderId null, missing, and a real id without wiping other fields
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/adapters/author-action.ts:36:17
     store.updateFile(asString(p.id), {
       title: p.title !== undefined ? String(p.title) : undefined,
       body: p.body !== undefined ? String(p.body) : undefined,
-      selected: typeof p.selected === "boolean" ? p.selected : undefined,
+      selected: true ? p.selected : undefined,
       folderId: p.folderId === null ? null : p.folderId ? String(p.folderId) : undefined,
     }),
killedBy: author-action adapter maps folderId null, missing, and a real id without wiping other fields
statusReason: expected 'yes' to be true // Object.is equality

[Killed] ConditionalExpression
src/adapters/author-action.ts:37:17
       title: p.title !== undefined ? String(p.title) : undefined,
       body: p.body !== undefined ? String(p.body) : undefined,
       selected: typeof p.selected === "boolean" ? p.selected : undefined,
-      folderId: p.folderId === null ? null : p.folderId ? String(p.folderId) : undefined,
+      folderId: true ? null : p.folderId ? String(p.folderId) : undefined,
     }),
   addHighlight: (store, p) => store.addHighlight(asString(p.fileId), asString(p.text)),
killedBy: author-action adapter maps folderId null, missing, and a real id without wiping other fields
statusReason: expected null to be 'folder-ilm0yvdx-msraggbj' // Object.is equality

[Killed] EqualityOperator
src/adapters/author-action.ts:37:17
       title: p.title !== undefined ? String(p.title) : undefined,
       body: p.body !== undefined ? String(p.body) : undefined,
       selected: typeof p.selected === "boolean" ? p.selected : undefined,
-      folderId: p.folderId === null ? null : p.folderId ? String(p.folderId) : undefined,
+      folderId: p.folderId !== null ? null : p.folderId ? String(p.folderId) : undefined,
     }),
   addHighlight: (store, p) => store.addHighlight(asString(p.fileId), asString(p.text)),
killedBy: author-action adapter maps folderId null, missing, and a real id without wiping other fields
statusReason: expected 'folder-1ovuot7u-msraggen' to be null

[Killed] ArrowFunction
src/adapters/author-action.ts:39:17
       selected: typeof p.selected === "boolean" ? p.selected : undefined,
       folderId: p.folderId === null ? null : p.folderId ? String(p.folderId) : undefined,
     }),
-  addHighlight: (store, p) => store.addHighlight(asString(p.fileId), asString(p.text)),
+  addHighlight: () => undefined,
   toggleHighlight: (store, p) =>
     store.toggleHighlight(asString(p.id), typeof p.selected === "boolean" ? p.selected : undefined),
killedBy: author-action adapter adds pasted links, starts chat with a default title, and copies a file
statusReason: Cannot read properties of undefined (reading 'selected')

[Killed] ArrowFunction
src/adapters/author-action.ts:40:20
       folderId: p.folderId === null ? null : p.folderId ? String(p.folderId) : undefined,
     }),
   addHighlight: (store, p) => store.addHighlight(asString(p.fileId), asString(p.text)),
-  toggleHighlight: (store, p) =>
-    store.toggleHighlight(asString(p.id), typeof p.selected === "boolean" ? p.selected : undefined),
+  toggleHighlight: () => undefined,
   createFolder: (store, p) => store.createFolder(asString(p.boardId), asString(p.name, "新文件夹")),
   moveFileToFolder: (store, p) =>
killedBy: author-action adapter adds pasted links, starts chat with a default title, and copies a file
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/adapters/author-action.ts:41:43
     }),
   addHighlight: (store, p) => store.addHighlight(asString(p.fileId), asString(p.text)),
   toggleHighlight: (store, p) =>
-    store.toggleHighlight(asString(p.id), typeof p.selected === "boolean" ? p.selected : undefined),
+    store.toggleHighlight(asString(p.id), false ? p.selected : undefined),
   createFolder: (store, p) => store.createFolder(asString(p.boardId), asString(p.name, "新文件夹")),
   moveFileToFolder: (store, p) =>
killedBy: author-action adapter covers rename, delete, switch, link, write, and chat handlers
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/adapters/author-action.ts:41:43
     }),
   addHighlight: (store, p) => store.addHighlight(asString(p.fileId), asString(p.text)),
   toggleHighlight: (store, p) =>
-    store.toggleHighlight(asString(p.id), typeof p.selected === "boolean" ? p.selected : undefined),
+    store.toggleHighlight(asString(p.id), typeof p.selected !== "boolean" ? p.selected : undefined),
   createFolder: (store, p) => store.createFolder(asString(p.boardId), asString(p.name, "新文件夹")),
   moveFileToFolder: (store, p) =>
killedBy: author-action adapter adds pasted links, starts chat with a default title, and copies a file
statusReason: expected 'nope' to be false // Object.is equality

[Killed] ArrowFunction
src/adapters/author-action.ts:42:17
   addHighlight: (store, p) => store.addHighlight(asString(p.fileId), asString(p.text)),
   toggleHighlight: (store, p) =>
     store.toggleHighlight(asString(p.id), typeof p.selected === "boolean" ? p.selected : undefined),
-  createFolder: (store, p) => store.createFolder(asString(p.boardId), asString(p.name, "新文件夹")),
+  createFolder: () => undefined,
   moveFileToFolder: (store, p) =>
     store.moveFileToFolder(asString(p.fileId), p.folderId ? String(p.folderId) : null),
killedBy: author-action adapter maps folderId null, missing, and a real id without wiping other fields
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] StringLiteral
src/adapters/author-action.ts:42:88
   addHighlight: (store, p) => store.addHighlight(asString(p.fileId), asString(p.text)),
   toggleHighlight: (store, p) =>
     store.toggleHighlight(asString(p.id), typeof p.selected === "boolean" ? p.selected : undefined),
-  createFolder: (store, p) => store.createFolder(asString(p.boardId), asString(p.name, "新文件夹")),
+  createFolder: (store, p) => store.createFolder(asString(p.boardId), asString(p.name, "")),
   moveFileToFolder: (store, p) =>
     store.moveFileToFolder(asString(p.fileId), p.folderId ? String(p.folderId) : null),
killedBy: author-action adapter maps folderId null, missing, and a real id without wiping other fields
statusReason: expected '' to be '新文件夹' // Object.is equality

[Killed] ArrowFunction
src/adapters/author-action.ts:43:21
   toggleHighlight: (store, p) =>
     store.toggleHighlight(asString(p.id), typeof p.selected === "boolean" ? p.selected : undefined),
   createFolder: (store, p) => store.createFolder(asString(p.boardId), asString(p.name, "新文件夹")),
-  moveFileToFolder: (store, p) =>
-    store.moveFileToFolder(asString(p.fileId), p.folderId ? String(p.folderId) : null),
+  moveFileToFolder: () => undefined,
   setTranscription: (store, p) =>
     store.setTranscription(asString(p.fileId), p.outcome === "failed" ? "failed" : "success"),
killedBy: author-action adapter maps folderId null, missing, and a real id without wiping other fields
statusReason: expected null to be 'folder-9ibs3cv8-msraghz5' // Object.is equality

[Killed] ArrowFunction
src/adapters/author-action.ts:45:21
   createFolder: (store, p) => store.createFolder(asString(p.boardId), asString(p.name, "新文件夹")),
   moveFileToFolder: (store, p) =>
     store.moveFileToFolder(asString(p.fileId), p.folderId ? String(p.folderId) : null),
-  setTranscription: (store, p) =>
-    store.setTranscription(asString(p.fileId), p.outcome === "failed" ? "failed" : "success"),
+  setTranscription: () => undefined,
   startChat: (store, p) => store.startChatTask(asString(p.boardId), asString(p.title, "Chat")),
   askChat: (store, p) =>
killedBy: author-action adapter treats only outcome=failed as a failed transcription
statusReason: expected 'success' to be 'failed' // Object.is equality

[Killed] ConditionalExpression
src/adapters/author-action.ts:46:48
   moveFileToFolder: (store, p) =>
     store.moveFileToFolder(asString(p.fileId), p.folderId ? String(p.folderId) : null),
   setTranscription: (store, p) =>
-    store.setTranscription(asString(p.fileId), p.outcome === "failed" ? "failed" : "success"),
+    store.setTranscription(asString(p.fileId), true ? "failed" : "success"),
   startChat: (store, p) => store.startChatTask(asString(p.boardId), asString(p.title, "Chat")),
   askChat: (store, p) =>
killedBy: author-action adapter treats only outcome=failed as a failed transcription
statusReason: expected 'failed' to be 'success' // Object.is equality

[Killed] ConditionalExpression
src/adapters/author-action.ts:46:48
   moveFileToFolder: (store, p) =>
     store.moveFileToFolder(asString(p.fileId), p.folderId ? String(p.folderId) : null),
   setTranscription: (store, p) =>
-    store.setTranscription(asString(p.fileId), p.outcome === "failed" ? "failed" : "success"),
+    store.setTranscription(asString(p.fileId), false ? "failed" : "success"),
   startChat: (store, p) => store.startChatTask(asString(p.boardId), asString(p.title, "Chat")),
   askChat: (store, p) =>
killedBy: author-action adapter treats only outcome=failed as a failed transcription
statusReason: expected 'success' to be 'failed' // Object.is equality

[Killed] ArrowFunction
src/adapters/author-action.ts:47:14
     store.moveFileToFolder(asString(p.fileId), p.folderId ? String(p.folderId) : null),
   setTranscription: (store, p) =>
     store.setTranscription(asString(p.fileId), p.outcome === "failed" ? "failed" : "success"),
-  startChat: (store, p) => store.startChatTask(asString(p.boardId), asString(p.title, "Chat")),
+  startChat: () => undefined,
   askChat: (store, p) =>
     store.askChat(asString(p.taskId), asString(p.question), p.currentFileId ? String(p.currentFileId) : undefined),
killedBy: author-action adapter adds pasted links, starts chat with a default title, and copies a file
statusReason: Cannot read properties of undefined (reading 'title')

[Killed] StringLiteral
src/adapters/author-action.ts:47:87
     store.moveFileToFolder(asString(p.fileId), p.folderId ? String(p.folderId) : null),
   setTranscription: (store, p) =>
     store.setTranscription(asString(p.fileId), p.outcome === "failed" ? "failed" : "success"),
-  startChat: (store, p) => store.startChatTask(asString(p.boardId), asString(p.title, "Chat")),
+  startChat: (store, p) => store.startChatTask(asString(p.boardId), asString(p.title, "")),
   askChat: (store, p) =>
     store.askChat(asString(p.taskId), asString(p.question), p.currentFileId ? String(p.currentFileId) : undefined),
killedBy: author-action adapter adds pasted links, starts chat with a default title, and copies a file
statusReason: expected '' to be 'Chat' // Object.is equality

[Killed] ArrowFunction
src/adapters/author-action.ts:48:12
   setTranscription: (store, p) =>
     store.setTranscription(asString(p.fileId), p.outcome === "failed" ? "failed" : "success"),
   startChat: (store, p) => store.startChatTask(asString(p.boardId), asString(p.title, "Chat")),
-  askChat: (store, p) =>
-    store.askChat(asString(p.taskId), asString(p.question), p.currentFileId ? String(p.currentFileId) : undefined),
+  askChat: () => undefined,
   generateWrite: (store, p) => store.generateWrite(asString(p.boardId), p.genre as WriteGenre),
   createShare: (store, p) => store.createShare(asString(p.fileId)),
killedBy: author-action adapter covers rename, delete, switch, link, write, and chat handlers
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] ArrowFunction
src/adapters/author-action.ts:50:18
   startChat: (store, p) => store.startChatTask(asString(p.boardId), asString(p.title, "Chat")),
   askChat: (store, p) =>
     store.askChat(asString(p.taskId), asString(p.question), p.currentFileId ? String(p.currentFileId) : undefined),
-  generateWrite: (store, p) => store.generateWrite(asString(p.boardId), p.genre as WriteGenre),
+  generateWrite: () => undefined,
   createShare: (store, p) => store.createShare(asString(p.fileId)),
   copyFile: (store, p) => ({ text: store.copyFile(asString(p.fileId)) }),
killedBy: author-action adapter covers rename, delete, switch, link, write, and chat handlers
statusReason: Cannot read properties of undefined (reading 'writeGenre')

[Killed] ArrowFunction
src/adapters/author-action.ts:51:16
   askChat: (store, p) =>
     store.askChat(asString(p.taskId), asString(p.question), p.currentFileId ? String(p.currentFileId) : undefined),
   generateWrite: (store, p) => store.generateWrite(asString(p.boardId), p.genre as WriteGenre),
-  createShare: (store, p) => store.createShare(asString(p.fileId)),
+  createShare: () => undefined,
   copyFile: (store, p) => ({ text: store.copyFile(asString(p.fileId)) }),
 };
killedBy: author-action adapter adds pasted links, starts chat with a default title, and copies a file
statusReason: Cannot read properties of undefined (reading 'token')

[Killed] ArrowFunction
src/adapters/author-action.ts:52:13
     store.askChat(asString(p.taskId), asString(p.question), p.currentFileId ? String(p.currentFileId) : undefined),
   generateWrite: (store, p) => store.generateWrite(asString(p.boardId), p.genre as WriteGenre),
   createShare: (store, p) => store.createShare(asString(p.fileId)),
-  copyFile: (store, p) => ({ text: store.copyFile(asString(p.fileId)) }),
+  copyFile: () => undefined,
 };
 
killedBy: author-action adapter adds pasted links, starts chat with a default title, and copies a file
statusReason: expected undefined to deeply equal { text: '甲\n\n正文' }

[Killed] ObjectLiteral
src/adapters/author-action.ts:52:28
     store.askChat(asString(p.taskId), asString(p.question), p.currentFileId ? String(p.currentFileId) : undefined),
   generateWrite: (store, p) => store.generateWrite(asString(p.boardId), p.genre as WriteGenre),
   createShare: (store, p) => store.createShare(asString(p.fileId)),
-  copyFile: (store, p) => ({ text: store.copyFile(asString(p.fileId)) }),
+  copyFile: (store, p) => ({}),
 };
 
killedBy: author-action adapter adds pasted links, starts chat with a default title, and copies a file
statusReason: expected {} to deeply equal { text: '甲\n\n正文' }

[Killed] BlockStatement
src/adapters/author-action.ts:55:90
   copyFile: (store, p) => ({ text: store.copyFile(asString(p.fileId)) }),
 };
 
-export function runAuthorAction(store: GaotaiStore, type: string, payload: Payload = {}) {
-  const handler = HANDLERS[type];
-  if (!handler) throw new Error(`未知操作 ${type}`);
-  return handler(store, payload);
-}
+export function runAuthorAction(store: GaotaiStore, type: string, payload: Payload = {}) {}
 
killedBy: author-action adapter falls back empty names and keeps unknown ops rejected
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BooleanLiteral
src/adapters/author-action.ts:57:7
 
 export function runAuthorAction(store: GaotaiStore, type: string, payload: Payload = {}) {
   const handler = HANDLERS[type];
-  if (!handler) throw new Error(`未知操作 ${type}`);
+  if (handler) throw new Error(`未知操作 ${type}`);
   return handler(store, payload);
 }
killedBy: author-action adapter falls back empty names and keeps unknown ops rejected
statusReason: 未知操作 createBoard

[Killed] ConditionalExpression
src/adapters/author-action.ts:57:7
 
 export function runAuthorAction(store: GaotaiStore, type: string, payload: Payload = {}) {
   const handler = HANDLERS[type];
-  if (!handler) throw new Error(`未知操作 ${type}`);
+  if (true) throw new Error(`未知操作 ${type}`);
   return handler(store, payload);
 }
killedBy: author-action adapter falls back empty names and keeps unknown ops rejected
statusReason: 未知操作 createBoard
