[Killed] BlockStatement
src/adapters/browser.ts:4:40
 import { isTextMime } from "@/domain/classify";
 import { sharePath } from "@/domain/share";
 
-export function selectedText(): string {
-  if (typeof window === "undefined") return "";
-  return window.getSelection()?.toString().trim() ?? "";
-}
+export function selectedText(): string {}
 
 export async function writeClipboard(text: string) {
killedBy: browser adapter returns an empty selection when window is missing or blank
statusReason: expected undefined to be '' // Object.is equality

[Killed] ConditionalExpression
src/adapters/browser.ts:5:7
 import { sharePath } from "@/domain/share";
 
 export function selectedText(): string {
-  if (typeof window === "undefined") return "";
+  if (true) return "";
   return window.getSelection()?.toString().trim() ?? "";
 }
killedBy: browser adapter returns an empty selection when window is missing or blank
statusReason: expected '' to be 'hi' // Object.is equality

[Killed] EqualityOperator
src/adapters/browser.ts:5:7
 import { sharePath } from "@/domain/share";
 
 export function selectedText(): string {
-  if (typeof window === "undefined") return "";
+  if (typeof window !== "undefined") return "";
   return window.getSelection()?.toString().trim() ?? "";
 }
killedBy: browser adapter returns an empty selection when window is missing or blank
statusReason: StrykerJS: Unknown test failure

[Killed] LogicalOperator
src/adapters/browser.ts:6:10
 
 export function selectedText(): string {
   if (typeof window === "undefined") return "";
-  return window.getSelection()?.toString().trim() ?? "";
+  return window.getSelection()?.toString().trim() && "";
 }
 
killedBy: browser adapter returns an empty selection when window is missing or blank
statusReason: expected '' to be 'hi' // Object.is equality

[Killed] OptionalChaining
src/adapters/browser.ts:6:10
 
 export function selectedText(): string {
   if (typeof window === "undefined") return "";
-  return window.getSelection()?.toString().trim() ?? "";
+  return window.getSelection().toString().trim() ?? "";
 }
 
killedBy: browser adapter returns an empty selection when window is missing or blank
statusReason: Cannot read properties of null (reading 'toString')

[Killed] BlockStatement
src/adapters/browser.ts:9:52
   return window.getSelection()?.toString().trim() ?? "";
 }
 
-export async function writeClipboard(text: string) {
-  await navigator.clipboard?.writeText(text).catch(() => undefined);
-}
+export async function writeClipboard(text: string) {}
 
 export function rememberCopiedText(text: string) {
killedBy: browser adapter writes the clipboard and remembers the last copied text
statusReason: expected "spy" to be called with arguments: [ 'copied' ]

Received: 



Number of calls: 0

[Survived] OptionalChaining
src/adapters/browser.ts:10:9
 }
 
 export async function writeClipboard(text: string) {
-  await navigator.clipboard?.writeText(text).catch(() => undefined);
+  await navigator.clipboard.writeText(text).catch(() => undefined);
 }
 

[Killed] BlockStatement
src/adapters/browser.ts:13:50
   await navigator.clipboard?.writeText(text).catch(() => undefined);
 }
 
-export function rememberCopiedText(text: string) {
-  (window as unknown as { __lastCopy?: string }).__lastCopy = text;
-  document.body.setAttribute("data-last-copy", text);
-}
+export function rememberCopiedText(text: string) {}
 
 export function absoluteShareUrl(token: string) {
killedBy: browser adapter writes the clipboard and remembers the last copied text
statusReason: expected undefined to be 'copied' // Object.is equality

[Killed] StringLiteral
src/adapters/browser.ts:15:30
 
 export function rememberCopiedText(text: string) {
   (window as unknown as { __lastCopy?: string }).__lastCopy = text;
-  document.body.setAttribute("data-last-copy", text);
+  document.body.setAttribute("", text);
 }
 
killedBy: browser adapter writes the clipboard and remembers the last copied text
statusReason: expected "spy" to be called with arguments: [ 'data-last-copy', 'copied' ]

Received: 

  1st spy call:

  Array [
-   "data-last-copy",

[Killed] BlockStatement
src/adapters/browser.ts:18:49
   document.body.setAttribute("data-last-copy", text);
 }
 
-export function absoluteShareUrl(token: string) {
-  return `${window.location.origin}${sharePath(token)}`;
-}
+export function absoluteShareUrl(token: string) {}
 
 export function readAsDataUrl(file: Blob): Promise<string> {
killedBy: browser adapter builds an absolute share URL from the current origin
statusReason: expected undefined to be 'http://127.0.0.1:3000/share/tok-1' // Object.is equality

[Killed] BlockStatement
src/adapters/browser.ts:22:60
   return `${window.location.origin}${sharePath(token)}`;
 }
 
-export function readAsDataUrl(file: Blob): Promise<string> {
-  return new Promise((resolve) => {
-    const reader = new FileReader();
-    reader.onload = () => resolve(String(reader.result || ""));
-    reader.readAsDataURL(file);
-  });
-}
+export function readAsDataUrl(file: Blob): Promise<string> {}
 
 export async function readLocalTextBody(file: { type: string; text: () => Promise<string> }) {
killedBy: browser adapter reads a blob as a data URL and only loads local text/* bodies
statusReason: You must provide a Promise to expect() when using .resolves, not 'undefined'.

[Killed] BlockStatement
src/adapters/browser.ts:23:35
 }
 
 export function readAsDataUrl(file: Blob): Promise<string> {
-  return new Promise((resolve) => {
-    const reader = new FileReader();
-    reader.onload = () => resolve(String(reader.result || ""));
-    reader.readAsDataURL(file);
-  });
+  return new Promise((resolve) => {});
 }
 
killedBy: browser adapter reads a blob as a data URL and only loads local text/* bodies
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/adapters/browser.ts:25:42
 export function readAsDataUrl(file: Blob): Promise<string> {
   return new Promise((resolve) => {
     const reader = new FileReader();
-    reader.onload = () => resolve(String(reader.result || ""));
+    reader.onload = () => resolve(String(true));
     reader.readAsDataURL(file);
   });
killedBy: browser adapter reads a blob as a data URL and only loads local text/* bodies
statusReason: expected 'true' to be 'data:text/plain;base64,xx' // Object.is equality

[Killed] LogicalOperator
src/adapters/browser.ts:25:42
 export function readAsDataUrl(file: Blob): Promise<string> {
   return new Promise((resolve) => {
     const reader = new FileReader();
-    reader.onload = () => resolve(String(reader.result || ""));
+    reader.onload = () => resolve(String(reader.result && ""));
     reader.readAsDataURL(file);
   });
killedBy: browser adapter reads a blob as a data URL and only loads local text/* bodies
statusReason: expected '' to be 'data:text/plain;base64,xx' // Object.is equality

[Killed] BlockStatement
src/adapters/browser.ts:30:94
   });
 }
 
-export async function readLocalTextBody(file: { type: string; text: () => Promise<string> }) {
-  if (!isTextMime(file.type)) return undefined;
-  return file.text();
-}
+export async function readLocalTextBody(file: { type: string; text: () => Promise<string> }) {}
 
killedBy: ui decision helpers picks composer board, question, canvas mode, archived empty
statusReason: expected undefined to be 'hi' // Object.is equality

[Killed] BooleanLiteral
src/adapters/browser.ts:31:7
 }
 
 export async function readLocalTextBody(file: { type: string; text: () => Promise<string> }) {
-  if (!isTextMime(file.type)) return undefined;
+  if (isTextMime(file.type)) return undefined;
   return file.text();
 }
killedBy: browser adapter reads a blob as a data URL and only loads local text/* bodies
statusReason: expected undefined to be 'hi' // Object.is equality

[Killed] ConditionalExpression
src/adapters/browser.ts:31:7
 }
 
 export async function readLocalTextBody(file: { type: string; text: () => Promise<string> }) {
-  if (!isTextMime(file.type)) return undefined;
+  if (true) return undefined;
   return file.text();
 }
killedBy: ui decision helpers picks composer board, question, canvas mode, archived empty
statusReason: expected undefined to be 'hi' // Object.is equality
