[Killed] BlockStatement
src/domain/classify.ts:7:53
 const AUDIO_EXT = /\.(mp3|wav|m4a|aac|ogg)$/;
 const VIDEO_EXT = /\.(mp4|webm|mov)$/;
 
-export function classifyLink(url: string): FileKind {
-  const lower = url.toLowerCase();
-  if (lower.includes("youtube.com") || lower.includes("youtu.be")) return "youtube";
-  return "web";
-}
+export function classifyLink(url: string): FileKind {}
 
 export function linkPreview(url: string) {
killedBy: domain invariants classifies links and local names deterministically
statusReason: Property failed after 1 tests
{ seed: 1835733460, path: "0", endOnFailure: true }
Counterexample: ["https://www.youtube.com/watch?v=1"]
Shrunk 0 time(s)
Got AssertionError: expected [ 'youtube', 'web' ] to include undefined

[Killed] MethodExpression
src/domain/classify.ts:8:17
 const VIDEO_EXT = /\.(mp4|webm|mov)$/;
 
 export function classifyLink(url: string): FileKind {
-  const lower = url.toLowerCase();
+  const lower = url.toUpperCase();
   if (lower.includes("youtube.com") || lower.includes("youtu.be")) return "youtube";
   return "web";
killedBy: classify classifies youtube and generic web links
statusReason: expected 'web' to be 'youtube' // Object.is equality

[Killed] ConditionalExpression
src/domain/classify.ts:9:7
 
 export function classifyLink(url: string): FileKind {
   const lower = url.toLowerCase();
-  if (lower.includes("youtube.com") || lower.includes("youtu.be")) return "youtube";
+  if (false) return "youtube";
   return "web";
 }
killedBy: classify classifies youtube and generic web links
statusReason: expected 'web' to be 'youtube' // Object.is equality

[Killed] LogicalOperator
src/domain/classify.ts:9:7
 
 export function classifyLink(url: string): FileKind {
   const lower = url.toLowerCase();
-  if (lower.includes("youtube.com") || lower.includes("youtu.be")) return "youtube";
+  if (lower.includes("youtube.com") && lower.includes("youtu.be")) return "youtube";
   return "web";
 }
killedBy: classify classifies youtube and generic web links
statusReason: expected 'web' to be 'youtube' // Object.is equality

[Killed] BlockStatement
src/domain/classify.ts:13:42
   return "web";
 }
 
-export function linkPreview(url: string) {
-  const kind = classifyLink(url);
-  if (kind === "youtube") {
-    return { kind, title: "YouTube 视频", body: `YouTube 来源：${url}` };
-  }
-  const title = titleFromUrl(url);
-  return { kind, title, body: cleanWebBody(url, title) };
-}
+export function linkPreview(url: string) {}
 
 function isImage(name: string, mime: string) {
killedBy: classify derives a host title and clean web body
statusReason: expected undefined to deeply equal { kind: 'youtube', …(2) }

[Killed] EqualityOperator
src/domain/classify.ts:15:7
 
 export function linkPreview(url: string) {
   const kind = classifyLink(url);
-  if (kind === "youtube") {
+  if (kind !== "youtube") {
     return { kind, title: "YouTube 视频", body: `YouTube 来源：${url}` };
   }
killedBy: classify derives a host title and clean web body
statusReason: expected { kind: 'youtube', …(2) } to deeply equal { kind: 'youtube', …(2) }

[Killed] BlockStatement
src/domain/classify.ts:15:27
 
 export function linkPreview(url: string) {
   const kind = classifyLink(url);
-  if (kind === "youtube") {
-    return { kind, title: "YouTube 视频", body: `YouTube 来源：${url}` };
-  }
+  if (kind === "youtube") {}
   const title = titleFromUrl(url);
   return { kind, title, body: cleanWebBody(url, title) };
killedBy: classify derives a host title and clean web body
statusReason: expected { kind: 'youtube', …(2) } to deeply equal { kind: 'youtube', …(2) }

[Killed] BlockStatement
src/domain/classify.ts:22:46
   return { kind, title, body: cleanWebBody(url, title) };
 }
 
-function isImage(name: string, mime: string) {
-  return mime.startsWith("image/") || IMAGE_EXT.test(name);
-}
+function isImage(name: string, mime: string) {}
 
 function isAudio(name: string, mime: string) {
killedBy: classify classifies local names by mime or extension
statusReason: expected 'document' to be 'image' // Object.is equality

[Killed] ConditionalExpression
src/domain/classify.ts:23:10
 }
 
 function isImage(name: string, mime: string) {
-  return mime.startsWith("image/") || IMAGE_EXT.test(name);
+  return true;
 }
 
killedBy: classify classifies local names by mime or extension
statusReason: expected 'image' to be 'audio' // Object.is equality

[Killed] LogicalOperator
src/domain/classify.ts:23:10
 }
 
 function isImage(name: string, mime: string) {
-  return mime.startsWith("image/") || IMAGE_EXT.test(name);
+  return mime.startsWith("image/") && IMAGE_EXT.test(name);
 }
 
killedBy: classify classifies local names by mime or extension
statusReason: expected 'document' to be 'image' // Object.is equality

[Killed] BlockStatement
src/domain/classify.ts:26:46
   return mime.startsWith("image/") || IMAGE_EXT.test(name);
 }
 
-function isAudio(name: string, mime: string) {
-  return mime.startsWith("audio/") || AUDIO_EXT.test(name);
-}
+function isAudio(name: string, mime: string) {}
 
 function isVideo(name: string, mime: string) {
killedBy: classify classifies local names by mime or extension
statusReason: expected 'document' to be 'audio' // Object.is equality

[Killed] LogicalOperator
src/domain/classify.ts:27:10
 }
 
 function isAudio(name: string, mime: string) {
-  return mime.startsWith("audio/") || AUDIO_EXT.test(name);
+  return mime.startsWith("audio/") && AUDIO_EXT.test(name);
 }
 
killedBy: classify classifies local names by mime or extension
statusReason: expected 'document' to be 'audio' // Object.is equality

[Killed] ConditionalExpression
src/domain/classify.ts:27:10
 }
 
 function isAudio(name: string, mime: string) {
-  return mime.startsWith("audio/") || AUDIO_EXT.test(name);
+  return false;
 }
 
killedBy: classify classifies local names by mime or extension
statusReason: expected 'document' to be 'audio' // Object.is equality

[Killed] BlockStatement
src/domain/classify.ts:30:46
   return mime.startsWith("audio/") || AUDIO_EXT.test(name);
 }
 
-function isVideo(name: string, mime: string) {
-  return mime.startsWith("video/") || VIDEO_EXT.test(name);
-}
+function isVideo(name: string, mime: string) {}
 
 export function isTextMime(mime: string) {
killedBy: classify classifies local names by mime or extension
statusReason: expected 'document' to be 'video' // Object.is equality

[Killed] ConditionalExpression
src/domain/classify.ts:31:10
 }
 
 function isVideo(name: string, mime: string) {
-  return mime.startsWith("video/") || VIDEO_EXT.test(name);
+  return true;
 }
 
killedBy: classify classifies local names by mime or extension
statusReason: expected 'video' to be 'document' // Object.is equality

[Killed] ConditionalExpression
src/domain/classify.ts:31:10
 }
 
 function isVideo(name: string, mime: string) {
-  return mime.startsWith("video/") || VIDEO_EXT.test(name);
+  return false;
 }
 
killedBy: classify classifies local names by mime or extension
statusReason: expected 'document' to be 'video' // Object.is equality

[Killed] BlockStatement
src/domain/classify.ts:34:42
   return mime.startsWith("video/") || VIDEO_EXT.test(name);
 }
 
-export function isTextMime(mime: string) {
-  return mime.startsWith("text/");
-}
+export function isTextMime(mime: string) {}
 
 export function localFileBody(name: string, kind: FileKind, body?: string) {
killedBy: classify classifies local names by mime or extension
statusReason: expected undefined to be true // Object.is equality

[Killed] MethodExpression
src/domain/classify.ts:35:10
 }
 
 export function isTextMime(mime: string) {
-  return mime.startsWith("text/");
+  return mime.endsWith("text/");
 }
 
killedBy: classify classifies local names by mime or extension
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/domain/classify.ts:35:26
 }
 
 export function isTextMime(mime: string) {
-  return mime.startsWith("text/");
+  return mime.startsWith("");
 }
 
killedBy: classify classifies local names by mime or extension
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/domain/classify.ts:38:76
   return mime.startsWith("text/");
 }
 
-export function localFileBody(name: string, kind: FileKind, body?: string) {
-  if (body !== undefined) return body;
-  return kind === "document" ? `本地文档：${name}` : "";
-}
+export function localFileBody(name: string, kind: FileKind, body?: string) {}
 
 export function classifyLocalName(name: string, mime?: string): FileKind {
killedBy: classify classifies local names by mime or extension
statusReason: expected undefined to be '本地文档：notes.txt' // Object.is equality

[Killed] ConditionalExpression
src/domain/classify.ts:39:7
 }
 
 export function localFileBody(name: string, kind: FileKind, body?: string) {
-  if (body !== undefined) return body;
+  if (false) return body;
   return kind === "document" ? `本地文档：${name}` : "";
 }
killedBy: classify classifies local names by mime or extension
statusReason: expected '本地文档：notes.txt' to be 'hello' // Object.is equality

[Killed] EqualityOperator
src/domain/classify.ts:39:7
 }
 
 export function localFileBody(name: string, kind: FileKind, body?: string) {
-  if (body !== undefined) return body;
+  if (body === undefined) return body;
   return kind === "document" ? `本地文档：${name}` : "";
 }
killedBy: classify classifies local names by mime or extension
statusReason: expected undefined to be '本地文档：notes.txt' // Object.is equality

[Killed] ConditionalExpression
src/domain/classify.ts:40:10
 
 export function localFileBody(name: string, kind: FileKind, body?: string) {
   if (body !== undefined) return body;
-  return kind === "document" ? `本地文档：${name}` : "";
+  return false ? `本地文档：${name}` : "";
 }
 
killedBy: classify classifies local names by mime or extension
statusReason: expected '' to be '本地文档：notes.txt' // Object.is equality

[Killed] EqualityOperator
src/domain/classify.ts:40:10
 
 export function localFileBody(name: string, kind: FileKind, body?: string) {
   if (body !== undefined) return body;
-  return kind === "document" ? `本地文档：${name}` : "";
+  return kind !== "document" ? `本地文档：${name}` : "";
 }
 
killedBy: classify classifies local names by mime or extension
statusReason: expected '' to be '本地文档：notes.txt' // Object.is equality

[Killed] BlockStatement
src/domain/classify.ts:43:74
   return kind === "document" ? `本地文档：${name}` : "";
 }
 
-export function classifyLocalName(name: string, mime?: string): FileKind {
-  const lower = name.toLowerCase();
-  const kindMime = (mime ?? "").toLowerCase();
-  if (isImage(lower, kindMime)) return "image";
-  if (isAudio(lower, kindMime)) return "audio";
-  if (isVideo(lower, kindMime)) return "video";
-  return "document";
-}
+export function classifyLocalName(name: string, mime?: string): FileKind {}
 
 export function parsePastedLinks(text: string, max = 50) {
killedBy: classify classifies local names by mime or extension
statusReason: expected undefined to be 'image' // Object.is equality

[Killed] MethodExpression
src/domain/classify.ts:44:17
 }
 
 export function classifyLocalName(name: string, mime?: string): FileKind {
-  const lower = name.toLowerCase();
+  const lower = name.toUpperCase();
   const kindMime = (mime ?? "").toLowerCase();
   if (isImage(lower, kindMime)) return "image";
killedBy: classify classifies local names by mime or extension
statusReason: expected 'document' to be 'image' // Object.is equality

[Killed] MethodExpression
src/domain/classify.ts:45:20
 
 export function classifyLocalName(name: string, mime?: string): FileKind {
   const lower = name.toLowerCase();
-  const kindMime = (mime ?? "").toLowerCase();
+  const kindMime = (mime ?? "").toUpperCase();
   if (isImage(lower, kindMime)) return "image";
   if (isAudio(lower, kindMime)) return "audio";
killedBy: classify classifies local names by mime or extension
statusReason: expected 'document' to be 'image' // Object.is equality

[Killed] LogicalOperator
src/domain/classify.ts:45:21
 
 export function classifyLocalName(name: string, mime?: string): FileKind {
   const lower = name.toLowerCase();
-  const kindMime = (mime ?? "").toLowerCase();
+  const kindMime = (mime && "").toLowerCase();
   if (isImage(lower, kindMime)) return "image";
   if (isAudio(lower, kindMime)) return "audio";
killedBy: classify classifies local names by mime or extension
statusReason: expected 'document' to be 'image' // Object.is equality

[Killed] ConditionalExpression
src/domain/classify.ts:46:7
 export function classifyLocalName(name: string, mime?: string): FileKind {
   const lower = name.toLowerCase();
   const kindMime = (mime ?? "").toLowerCase();
-  if (isImage(lower, kindMime)) return "image";
+  if (false) return "image";
   if (isAudio(lower, kindMime)) return "audio";
   if (isVideo(lower, kindMime)) return "video";
killedBy: classify classifies local names by mime or extension
statusReason: expected 'document' to be 'image' // Object.is equality

[Killed] ConditionalExpression
src/domain/classify.ts:46:7
 export function classifyLocalName(name: string, mime?: string): FileKind {
   const lower = name.toLowerCase();
   const kindMime = (mime ?? "").toLowerCase();
-  if (isImage(lower, kindMime)) return "image";
+  if (true) return "image";
   if (isAudio(lower, kindMime)) return "audio";
   if (isVideo(lower, kindMime)) return "video";
killedBy: classify classifies local names by mime or extension
statusReason: expected 'image' to be 'audio' // Object.is equality

[Killed] ConditionalExpression
src/domain/classify.ts:47:7
   const lower = name.toLowerCase();
   const kindMime = (mime ?? "").toLowerCase();
   if (isImage(lower, kindMime)) return "image";
-  if (isAudio(lower, kindMime)) return "audio";
+  if (true) return "audio";
   if (isVideo(lower, kindMime)) return "video";
   return "document";
killedBy: classify classifies local names by mime or extension
statusReason: expected 'audio' to be 'video' // Object.is equality

[Killed] ConditionalExpression
src/domain/classify.ts:47:7
   const lower = name.toLowerCase();
   const kindMime = (mime ?? "").toLowerCase();
   if (isImage(lower, kindMime)) return "image";
-  if (isAudio(lower, kindMime)) return "audio";
+  if (false) return "audio";
   if (isVideo(lower, kindMime)) return "video";
   return "document";
killedBy: File / sources classifies youtube, image and audio
statusReason: expected 'document' to be 'audio' // Object.is equality

[Killed] ConditionalExpression
src/domain/classify.ts:48:7
   const kindMime = (mime ?? "").toLowerCase();
   if (isImage(lower, kindMime)) return "image";
   if (isAudio(lower, kindMime)) return "audio";
-  if (isVideo(lower, kindMime)) return "video";
+  if (false) return "video";
   return "document";
 }
killedBy: classify classifies local names by mime or extension
statusReason: expected 'document' to be 'video' // Object.is equality

[Killed] ConditionalExpression
src/domain/classify.ts:48:7
   const kindMime = (mime ?? "").toLowerCase();
   if (isImage(lower, kindMime)) return "image";
   if (isAudio(lower, kindMime)) return "audio";
-  if (isVideo(lower, kindMime)) return "video";
+  if (true) return "video";
   return "document";
 }
killedBy: classify classifies local names by mime or extension
statusReason: expected 'video' to be 'document' // Object.is equality

[Killed] StringLiteral
src/domain/classify.ts:49:10
   if (isImage(lower, kindMime)) return "image";
   if (isAudio(lower, kindMime)) return "audio";
   if (isVideo(lower, kindMime)) return "video";
-  return "document";
+  return "";
 }
 
killedBy: classify classifies local names by mime or extension
statusReason: expected '' to be 'document' // Object.is equality

[Killed] BlockStatement
src/domain/classify.ts:52:58
   return "document";
 }
 
-export function parsePastedLinks(text: string, max = 50) {
-  const all = text.split(/[\s\n]+/).map((item) => item.trim()).filter(Boolean);
-  return { all, urls: all.slice(0, max), count: all.length };
-}
+export function parsePastedLinks(text: string, max = 50) {}
 
 export function titleFromUrl(url: string): string {
killedBy: classify parses pasted links with a 50 cap
statusReason: Cannot read properties of undefined (reading 'count')

[Killed] MethodExpression
src/domain/classify.ts:53:15
 }
 
 export function parsePastedLinks(text: string, max = 50) {
-  const all = text.split(/[\s\n]+/).map((item) => item.trim()).filter(Boolean);
+  const all = text.split(/[\s\n]+/).map(item => item.trim());
   return { all, urls: all.slice(0, max), count: all.length };
 }
killedBy: ui decision helpers picks composer board, question, canvas mode, archived empty
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ArrowFunction
src/domain/classify.ts:53:41
 }
 
 export function parsePastedLinks(text: string, max = 50) {
-  const all = text.split(/[\s\n]+/).map((item) => item.trim()).filter(Boolean);
+  const all = text.split(/[\s\n]+/).map(() => undefined).filter(Boolean);
   return { all, urls: all.slice(0, max), count: all.length };
 }
killedBy: ui decision helpers picks composer board, question, canvas mode, archived empty
statusReason: expected [] to have a length of 2 but got +0

[Killed] MethodExpression
src/domain/classify.ts:54:23
 
 export function parsePastedLinks(text: string, max = 50) {
   const all = text.split(/[\s\n]+/).map((item) => item.trim()).filter(Boolean);
-  return { all, urls: all.slice(0, max), count: all.length };
+  return { all, urls: all, count: all.length };
 }
 
killedBy: classify parses pasted links with a 50 cap
statusReason: expected [ 'https://x.com/0', …(51) ] to have a length of 50 but got 52

[Killed] BlockStatement
src/domain/classify.ts:57:51
   return { all, urls: all.slice(0, max), count: all.length };
 }
 
-export function titleFromUrl(url: string): string {
-  try {
-    return new URL(url).hostname.replace(/^www\./, "");
-  } catch {
-    return url;
-  }
-}
+export function titleFromUrl(url: string): string {}
 
 export function cleanWebBody(url: string, title: string): string {
killedBy: classify derives a host title and clean web body
statusReason: expected undefined to be 'example.com' // Object.is equality

[Killed] BlockStatement
src/domain/classify.ts:58:7
 }
 
 export function titleFromUrl(url: string): string {
-  try {
-    return new URL(url).hostname.replace(/^www\./, "");
-  } catch {
+  try {} catch {
     return url;
   }
killedBy: classify derives a host title and clean web body
statusReason: expected undefined to be 'example.com' // Object.is equality

[Killed] StringLiteral
src/domain/classify.ts:59:52
 
 export function titleFromUrl(url: string): string {
   try {
-    return new URL(url).hostname.replace(/^www\./, "");
+    return new URL(url).hostname.replace(/^www\./, "Stryker was here!");
   } catch {
     return url;
killedBy: classify derives a host title and clean web body
statusReason: expected 'Stryker was here!example.com' to be 'example.com' // Object.is equality

[Killed] BlockStatement
src/domain/classify.ts:60:11
 export function titleFromUrl(url: string): string {
   try {
     return new URL(url).hostname.replace(/^www\./, "");
-  } catch {
-    return url;
-  }
+  } catch {}
 }
 
killedBy: classify derives a host title and clean web body
statusReason: expected undefined to be 'not-a-url' // Object.is equality

[Killed] BlockStatement
src/domain/classify.ts:65:66
   }
 }
 
-export function cleanWebBody(url: string, title: string): string {
-  return [
-    `${title} 的干净阅读正文。`,
-    `原文去掉导航、广告与侧栏后，只保留文章主体。`,
-    `来源页面：${url}`,
-  ].join("\n\n");
-}
+export function cleanWebBody(url: string, title: string): string {}
 
killedBy: classify derives a host title and clean web body
statusReason: expected undefined to be 'example.com 的干净阅读正文。\n\n原文去掉导航、广告与侧栏后…' // Object.is equality

[Killed] StringLiteral
src/domain/classify.ts:70:10
     `${title} 的干净阅读正文。`,
     `原文去掉导航、广告与侧栏后，只保留文章主体。`,
     `来源页面：${url}`,
-  ].join("\n\n");
+  ].join("");
 }
 
killedBy: classify derives a host title and clean web body
statusReason: expected 'example.com 的干净阅读正文。原文去掉导航、广告与侧栏后，只保留…' to be 'example.com 的干净阅读正文。\n\n原文去掉导航、广告与侧栏后…' // Object.is equality
