[Killed] BlockStatement
src/domain/generators.ts:10:74
   question: string,
   files: MaterialFile[],
   highlights: Highlight[],
-): { text: string; citedFileIds: string[]; citedHighlightIds: string[] } {
-  const citedFileIds = files.map((f) => f.id);
-  const citedHighlightIds = highlights.map((h) => h.id);
-  const fileBits = files.map((f) => `来源 file「${f.title}」`);
-  const highlightBits = highlights.map((h) => `高亮「${h.text}」`);
-  const cites = [...fileBits, ...highlightBits].join("、") || "已选材料";
-  const text = `依据 ${cites}：${question} 的要点是，先回到上述来源再作答。`;
-  return { text, citedFileIds, citedHighlightIds };
-}
+): { text: string; citedFileIds: string[]; citedHighlightIds: string[] } {}
 
 export function applyChatEdit(current: MaterialFile, instruction: string): MaterialFile {
killedBy: domain invariants cites only selected files and highlights in chat
statusReason: Property failed after 1 tests
{ seed: -1984887839, path: "0:0:0:0", endOnFailure: true }
Counterexample: [[false],"!"]
Shrunk 3 time(s)
Got TypeError: Cannot read properties of undefined (reading 'text')

[Killed] ArrowFunction
src/domain/generators.ts:11:34
   files: MaterialFile[],
   highlights: Highlight[],
 ): { text: string; citedFileIds: string[]; citedHighlightIds: string[] } {
-  const citedFileIds = files.map((f) => f.id);
+  const citedFileIds = files.map(() => undefined);
   const citedHighlightIds = highlights.map((h) => h.id);
   const fileBits = files.map((f) => `来源 file「${f.title}」`);
killedBy: domain invariants cites only selected files and highlights in chat
statusReason: Property failed after 2 tests
{ seed: -934572372, path: "1:0:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [[true],"!"]
Shrunk 8 time(s)
Got AssertionError: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/domain/generators.ts:12:44
   highlights: Highlight[],
 ): { text: string; citedFileIds: string[]; citedHighlightIds: string[] } {
   const citedFileIds = files.map((f) => f.id);
-  const citedHighlightIds = highlights.map((h) => h.id);
+  const citedHighlightIds = highlights.map(() => undefined);
   const fileBits = files.map((f) => `来源 file「${f.title}」`);
   const highlightBits = highlights.map((h) => `高亮「${h.text}」`);
killedBy: domain invariants cites only selected files and highlights in chat
statusReason: Property failed after 1 tests
{ seed: 1768550084, path: "0:0:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [[true],"!"]
Shrunk 9 time(s)
Got AssertionError: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/domain/generators.ts:13:30
 ): { text: string; citedFileIds: string[]; citedHighlightIds: string[] } {
   const citedFileIds = files.map((f) => f.id);
   const citedHighlightIds = highlights.map((h) => h.id);
-  const fileBits = files.map((f) => `来源 file「${f.title}」`);
+  const fileBits = files.map(() => undefined);
   const highlightBits = highlights.map((h) => `高亮「${h.text}」`);
   const cites = [...fileBits, ...highlightBits].join("、") || "已选材料";
killedBy: generators joins multiple chat sources with a顿号 and falls back when none are selected
statusReason: expected '依据 、：问 的要点是，先回到上述来源再作答。' to contain '来源 file「甲」'

[Killed] StringLiteral
src/domain/generators.ts:13:37
 ): { text: string; citedFileIds: string[]; citedHighlightIds: string[] } {
   const citedFileIds = files.map((f) => f.id);
   const citedHighlightIds = highlights.map((h) => h.id);
-  const fileBits = files.map((f) => `来源 file「${f.title}」`);
+  const fileBits = files.map((f) => ``);
   const highlightBits = highlights.map((h) => `高亮「${h.text}」`);
   const cites = [...fileBits, ...highlightBits].join("、") || "已选材料";
killedBy: Task chat answers from selected files and highlights and cites them
statusReason: expected '依据 、高亮「组织知识」：一句话解释知识管理 的要点是，先回到上述来源再作…' to contain 'Knowledge management'

[Killed] ArrowFunction
src/domain/generators.ts:14:40
   const citedFileIds = files.map((f) => f.id);
   const citedHighlightIds = highlights.map((h) => h.id);
   const fileBits = files.map((f) => `来源 file「${f.title}」`);
-  const highlightBits = highlights.map((h) => `高亮「${h.text}」`);
+  const highlightBits = highlights.map(() => undefined);
   const cites = [...fileBits, ...highlightBits].join("、") || "已选材料";
   const text = `依据 ${cites}：${question} 的要点是，先回到上述来源再作答。`;
killedBy: Task chat answers from selected files and highlights and cites them
statusReason: expected '依据 来源 file「Knowledge management」、：一句话…' to contain '组织知识'

[Killed] ConditionalExpression
src/domain/generators.ts:15:17
   const citedHighlightIds = highlights.map((h) => h.id);
   const fileBits = files.map((f) => `来源 file「${f.title}」`);
   const highlightBits = highlights.map((h) => `高亮「${h.text}」`);
-  const cites = [...fileBits, ...highlightBits].join("、") || "已选材料";
+  const cites = false;
   const text = `依据 ${cites}：${question} 的要点是，先回到上述来源再作答。`;
   return { text, citedFileIds, citedHighlightIds };
killedBy: Task chat answers from selected files and highlights and cites them
statusReason: expected '依据 false：一句话解释知识管理 的要点是，先回到上述来源再作答。' to contain 'Knowledge management'

[Killed] LogicalOperator
src/domain/generators.ts:15:17
   const citedHighlightIds = highlights.map((h) => h.id);
   const fileBits = files.map((f) => `来源 file「${f.title}」`);
   const highlightBits = highlights.map((h) => `高亮「${h.text}」`);
-  const cites = [...fileBits, ...highlightBits].join("、") || "已选材料";
+  const cites = [...fileBits, ...highlightBits].join("、") && "已选材料";
   const text = `依据 ${cites}：${question} 的要点是，先回到上述来源再作答。`;
   return { text, citedFileIds, citedHighlightIds };
killedBy: Task chat answers from selected files and highlights and cites them
statusReason: expected '依据 已选材料：一句话解释知识管理 的要点是，先回到上述来源再作答。' to contain 'Knowledge management'

[Killed] StringLiteral
src/domain/generators.ts:16:16
   const fileBits = files.map((f) => `来源 file「${f.title}」`);
   const highlightBits = highlights.map((h) => `高亮「${h.text}」`);
   const cites = [...fileBits, ...highlightBits].join("、") || "已选材料";
-  const text = `依据 ${cites}：${question} 的要点是，先回到上述来源再作答。`;
+  const text = ``;
   return { text, citedFileIds, citedHighlightIds };
 }
killedBy: generators joins multiple chat sources with a顿号 and falls back when none are selected
statusReason: expected '' to contain '来源 file「甲」'

[Killed] BlockStatement
src/domain/generators.ts:20:89
   return { text, citedFileIds, citedHighlightIds };
 }
 
-export function applyChatEdit(current: MaterialFile, instruction: string): MaterialFile {
-  return {
-    ...current,
-    body: `${current.body}\n\n（修订）${instruction}`,
-  };
-}
+export function applyChatEdit(current: MaterialFile, instruction: string): MaterialFile {}
 
 export function copyDocumentText(file: MaterialFile): string {
killedBy: domain invariants revises the open document in place when the question asks to edit
statusReason: Property failed after 1 tests
{ seed: -24208055, path: "0:0", endOnFailure: true }
Counterexample: ["修改当前这篇"]
Shrunk 1 time(s)
Got TypeError: Cannot read properties of undefined (reading 'body')

[Killed] StringLiteral
src/domain/generators.ts:23:11
 export function applyChatEdit(current: MaterialFile, instruction: string): MaterialFile {
   return {
     ...current,
-    body: `${current.body}\n\n（修订）${instruction}`,
+    body: ``,
   };
 }
killedBy: domain invariants revises the open document in place when the question asks to edit
statusReason: Property failed after 1 tests
{ seed: 176077322, path: "0", endOnFailure: true }
Counterexample: ["修改当前这篇"]
Shrunk 0 time(s)
Got AssertionError: expected '' to contain '修订'

[Killed] BlockStatement
src/domain/generators.ts:27:62
   };
 }
 
-export function copyDocumentText(file: MaterialFile): string {
-  return `${file.title}\n\n${file.body}`;
-}
+export function copyDocumentText(file: MaterialFile): string {}
 
 export function highlightTextFromSelection(file: { body: string; title: string }, selected: string) {
killedBy: domain invariants copies genre documents as title plus the required body fields
statusReason: Property failed after 1 tests
{ seed: 237914297, path: "0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["长文","!"]
Shrunk 9 time(s)
Got AssertionError: expected undefined to be '关于「!」的长文\n\n## 引言\n围绕「!」展开讨论。\n## 分析\…' // Object.is equality

[Killed] BlockStatement
src/domain/generators.ts:31:101
   return `${file.title}\n\n${file.body}`;
 }
 
-export function highlightTextFromSelection(file: { body: string; title: string }, selected: string) {
-  return selected || file.body.slice(0, 24) || file.title;
-}
+export function highlightTextFromSelection(file: { body: string; title: string }, selected: string) {}
 
 export function isReviseQuestion(question: string) {
killedBy: domain invariants keeps highlight text and share path policy in domain
statusReason: Property failed after 1 tests
{ seed: 412349380, path: "0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["!",""]
Shrunk 8 time(s)
Got AssertionError: expected undefined to be 'abcdefghijklmnop' // Object.is equality

[Killed] ConditionalExpression
src/domain/generators.ts:32:10
 }
 
 export function highlightTextFromSelection(file: { body: string; title: string }, selected: string) {
-  return selected || file.body.slice(0, 24) || file.title;
+  return true;
 }
 
killedBy: domain invariants keeps highlight text and share path policy in domain
statusReason: Property failed after 1 tests
{ seed: 1497458681, path: "0:0:0", endOnFailure: true }
Counterexample: ["!",""]
Shrunk 2 time(s)
Got AssertionError: expected true to be 'abcdefghijklmnop' // Object.is equality

[Killed] MethodExpression
src/domain/generators.ts:32:22
 }
 
 export function highlightTextFromSelection(file: { body: string; title: string }, selected: string) {
-  return selected || file.body.slice(0, 24) || file.title;
+  return selected || file.body || file.title;
 }
 
killedBy: generators takes the first 24 body characters when nothing is selected
statusReason: expected 'abcdefghijklmnopqrstuvwxyz0123' to be 'abcdefghijklmnopqrstuvwx' // Object.is equality

[Killed] BlockStatement
src/domain/generators.ts:35:52
   return selected || file.body.slice(0, 24) || file.title;
 }
 
-export function isReviseQuestion(question: string) {
-  return /修改|改一下|更新/.test(question);
-}
+export function isReviseQuestion(question: string) {}
 
 export function fakeTranscription(file: MaterialFile, force?: "success" | "failed") {
killedBy: domain invariants revises the open document in place when the question asks to edit
statusReason: Property failed after 1 tests
{ seed: 1838910889, path: "0", endOnFailure: true }
Counterexample: ["修改当前这篇"]
Shrunk 0 time(s)
Got AssertionError: expected '## 引言\n围绕「主题」展开讨论。\n## 分析\n结合已选材料进行分析…' to contain '修订'

[Killed] BlockStatement
src/domain/generators.ts:39:85
   return /修改|改一下|更新/.test(question);
 }
 
-export function fakeTranscription(file: MaterialFile, force?: "success" | "failed") {
-  const failHint = force === "failed" || `${file.title}${file.url || ""}`.toLowerCase().includes("fail");
-  if (failHint) {
-    return {
-      status: "failed" as const,
-      error: "转录失败",
-    };
-  }
-  return {
-    status: "success" as const,
-    text: `这是「${file.title}」的转录文本。`,
-    cues: [
-      { t: 0, text: "开场" },
-      { t: 12, text: "要点" },
-      { t: 30, text: "收束" },
-    ],
-  };
-}
+export function fakeTranscription(file: MaterialFile, force?: "success" | "failed") {}
 
killedBy: generators fails transcription from force, title, or url, independently
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] LogicalOperator
src/domain/generators.ts:40:58
 }
 
 export function fakeTranscription(file: MaterialFile, force?: "success" | "failed") {
-  const failHint = force === "failed" || `${file.title}${file.url || ""}`.toLowerCase().includes("fail");
+  const failHint = force === "failed" || `${file.title}${file.url && ""}`.toLowerCase().includes("fail");
   if (failHint) {
     return {
killedBy: generators fails transcription from force, title, or url, independently
statusReason: expected 'success' to be 'failed' // Object.is equality

[Killed] MethodExpression
src/domain/generators.ts:40:42
 }
 
 export function fakeTranscription(file: MaterialFile, force?: "success" | "failed") {
-  const failHint = force === "failed" || `${file.title}${file.url || ""}`.toLowerCase().includes("fail");
+  const failHint = force === "failed" || `${file.title}${file.url || ""}`.toUpperCase().includes("fail");
   if (failHint) {
     return {
killedBy: generators fails transcription from force, title, or url, independently
statusReason: expected 'success' to be 'failed' // Object.is equality

[Killed] ConditionalExpression
src/domain/generators.ts:41:7
 
 export function fakeTranscription(file: MaterialFile, force?: "success" | "failed") {
   const failHint = force === "failed" || `${file.title}${file.url || ""}`.toLowerCase().includes("fail");
-  if (failHint) {
+  if (true) {
     return {
       status: "failed" as const,
killedBy: generators fails transcription from force, title, or url, independently
statusReason: expected 'failed' to be 'success' // Object.is equality

[Killed] BlockStatement
src/domain/generators.ts:41:17
 
 export function fakeTranscription(file: MaterialFile, force?: "success" | "failed") {
   const failHint = force === "failed" || `${file.title}${file.url || ""}`.toLowerCase().includes("fail");
-  if (failHint) {
-    return {
-      status: "failed" as const,
-      error: "转录失败",
-    };
-  }
+  if (failHint) {}
   return {
     status: "success" as const,
killedBy: generators fails transcription from force, title, or url, independently
statusReason: expected 'success' to be 'failed' // Object.is equality

[Killed] StringLiteral
src/domain/generators.ts:44:14
   if (failHint) {
     return {
       status: "failed" as const,
-      error: "转录失败",
+      error: "",
     };
   }
killedBy: Transcription fails with a hint and does not block other files
statusReason: expected '' to be '转录失败' // Object.is equality

[Killed] ObjectLiteral
src/domain/generators.ts:47:10
       error: "转录失败",
     };
   }
-  return {
-    status: "success" as const,
-    text: `这是「${file.title}」的转录文本。`,
-    cues: [
-      { t: 0, text: "开场" },
-      { t: 12, text: "要点" },
-      { t: 30, text: "收束" },
-    ],
-  };
+  return {};
 }
 
killedBy: generators fails transcription from force, title, or url, independently
statusReason: expected undefined to be 'success' // Object.is equality

[Killed] StringLiteral
src/domain/generators.ts:49:11
   }
   return {
     status: "success" as const,
-    text: `这是「${file.title}」的转录文本。`,
+    text: ``,
     cues: [
       { t: 0, text: "开场" },
killedBy: Transcription succeeds with timeline cues
statusReason: expected '' to contain '转录文本'

[Killed] StringLiteral
src/domain/generators.ts:51:21
     status: "success" as const,
     text: `这是「${file.title}」的转录文本。`,
     cues: [
-      { t: 0, text: "开场" },
+      { t: 0, text: "" },
       { t: 12, text: "要点" },
       { t: 30, text: "收束" },
killedBy: generators emits the three timeline cues in order
statusReason: expected [ { t: +0, text: '' }, …(2) ] to deeply equal [ { t: +0, text: '开场' }, …(2) ]

[Killed] StringLiteral
src/domain/generators.ts:52:22
     text: `这是「${file.title}」的转录文本。`,
     cues: [
       { t: 0, text: "开场" },
-      { t: 12, text: "要点" },
+      { t: 12, text: "" },
       { t: 30, text: "收束" },
     ],
killedBy: generators emits the three timeline cues in order
statusReason: expected [ { t: +0, text: '开场' }, …(2) ] to deeply equal [ { t: +0, text: '开场' }, …(2) ]

[Killed] StringLiteral
src/domain/generators.ts:53:22
     cues: [
       { t: 0, text: "开场" },
       { t: 12, text: "要点" },
-      { t: 30, text: "收束" },
+      { t: 30, text: "" },
     ],
   };
killedBy: generators emits the three timeline cues in order
statusReason: expected [ { t: +0, text: '开场' }, …(2) ] to deeply equal [ { t: +0, text: '开场' }, …(2) ]
