[Killed] BlockStatement
src/adapters/http.ts:1:82
-export async function getJson<T>(url: string): Promise<{ ok: boolean; data: T }> {
-  const res = await fetch(url, { cache: "no-store" });
-  return { ok: res.ok, data: (await res.json()) as T };
-}
+export async function getJson<T>(url: string): Promise<{ ok: boolean; data: T }> {}
 
 export async function postJson<T>(url: string, body: unknown): Promise<T> {
killedBy: http adapter reads JSON with a no-store GET and preserves ok
statusReason: expected undefined to deeply equal { ok: true, data: { id: '1' } }

[Killed] ObjectLiteral
src/adapters/http.ts:2:32
 export async function getJson<T>(url: string): Promise<{ ok: boolean; data: T }> {
-  const res = await fetch(url, { cache: "no-store" });
+  const res = await fetch(url, {});
   return { ok: res.ok, data: (await res.json()) as T };
 }
killedBy: http adapter reads JSON with a no-store GET and preserves ok
statusReason: expected "spy" to be called with arguments: [ '/api/state', { cache: 'no-store' } ]

Received: 

  1st spy call:

  Array [
    "/api/state",

[Killed] ObjectLiteral
src/adapters/http.ts:3:10
 export async function getJson<T>(url: string): Promise<{ ok: boolean; data: T }> {
   const res = await fetch(url, { cache: "no-store" });
-  return { ok: res.ok, data: (await res.json()) as T };
+  return {};
 }
 
killedBy: http adapter reads JSON with a no-store GET and preserves ok
statusReason: expected {} to deeply equal { ok: true, data: { id: '1' } }

[Killed] BlockStatement
src/adapters/http.ts:6:75
   return { ok: res.ok, data: (await res.json()) as T };
 }
 
-export async function postJson<T>(url: string, body: unknown): Promise<T> {
-  const res = await fetch(url, {
-    method: "POST",
-    headers: { "Content-Type": "application/json" },
-    body: JSON.stringify(body),
-  });
-  return (await res.json()) as T;
-}
+export async function postJson<T>(url: string, body: unknown): Promise<T> {}
 
killedBy: http adapter posts JSON with the application/json header
statusReason: expected undefined to deeply equal { ok: true }

[Killed] StringLiteral
src/adapters/http.ts:8:13
 
 export async function postJson<T>(url: string, body: unknown): Promise<T> {
   const res = await fetch(url, {
-    method: "POST",
+    method: "",
     headers: { "Content-Type": "application/json" },
     body: JSON.stringify(body),
killedBy: http adapter posts JSON with the application/json header
statusReason: expected "spy" to be called with arguments: [ '/api/action', …(1) ]

Received: 

  1st spy call:

  Array [
    "/api/action",
