[Killed] BlockStatement
src/domain/id.ts:1:50
-export function createId(prefix: string): string {
-  return `${prefix}-${Math.random().toString(36).slice(2, 10)}-${Date.now().toString(36)}`;
-}
+export function createId(prefix: string): string {}
 
killedBy: domain invariants never lets one write overwrite another, including the same genre twice
statusReason: Property failed after 1 tests
{ seed: -428665166, path: "0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["长文","长文","!"]
Shrunk 10 time(s)
Got AssertionError: expected undefined not to be undefined // Object.is equality

[Survived] MethodExpression
src/domain/id.ts:2:23
 export function createId(prefix: string): string {
-  return `${prefix}-${Math.random().toString(36).slice(2, 10)}-${Date.now().toString(36)}`;
+  return `${prefix}-${Math.random().toString(36)}-${Date.now().toString(36)}`;
 }
 
