[Killed] BlockStatement
src/domain/share.ts:1:42
-export function sharePath(token: string) {
-  return `/share/${token}`;
-}
+export function sharePath(token: string) {}
 
killedBy: domain invariants keeps highlight text and share path policy in domain
statusReason: expected undefined to be '/share/tok-1' // Object.is equality
