[Killed] ObjectLiteral
src/domain/snapshot.ts:3:39
 import type { Author, StoreSnapshot } from "./types";
 
-export const DEFAULT_AUTHOR: Author = {
-  id: "author-1",
-  name: "zhoujw07",
-  plan: "Free",
-};
+export const DEFAULT_AUTHOR: Author = {};
 
 export const EMPTY_SNAPSHOT: StoreSnapshot = {
killedBy: store policy uses default names and the specified author id as board owner
statusReason: expected undefined to be 'author-1' // Object.is equality

[Killed] ObjectLiteral
src/domain/snapshot.ts:9:46
   plan: "Free",
 };
 
-export const EMPTY_SNAPSHOT: StoreSnapshot = {
-  boards: [],
-  folders: [],
-  files: [],
-  highlights: [],
-  tasks: [],
-  shareLinks: [],
-  currentBoardId: null,
-  author: { ...DEFAULT_AUTHOR },
-};
+export const EMPTY_SNAPSHOT: StoreSnapshot = {};
 
 function omitUndefined<T extends object>(obj: T): Partial<T> {
killedBy: snapshot and copy helpers fills a snapshot without wiping provided fields
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArrayDeclaration
src/domain/snapshot.ts:12:10
 export const EMPTY_SNAPSHOT: StoreSnapshot = {
   boards: [],
   folders: [],
-  files: [],
+  files: ["Stryker was here"],
   highlights: [],
   tasks: [],
killedBy: store policy resets to an empty snapshot without dropping the default author
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BlockStatement
src/domain/snapshot.ts:20:62
   author: { ...DEFAULT_AUTHOR },
 };
 
-function omitUndefined<T extends object>(obj: T): Partial<T> {
-  return Object.fromEntries(Object.entries(obj).filter(([, value]) => value !== undefined)) as Partial<T>;
-}
+function omitUndefined<T extends object>(obj: T): Partial<T> {}
 
 export function filledSnapshot(data: Partial<StoreSnapshot>): StoreSnapshot {
killedBy: domain invariants round-trips a snapshot without IO
statusReason: Property failed after 1 tests
{ seed: 2085453920, path: "0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["!",false]
Shrunk 8 time(s)
Got AssertionError: expected [] to deeply equal [ 'board-fv390mnt-msrab7m9' ]

[Killed] BlockStatement
src/domain/snapshot.ts:24:77
   return Object.fromEntries(Object.entries(obj).filter(([, value]) => value !== undefined)) as Partial<T>;
 }
 
-export function filledSnapshot(data: Partial<StoreSnapshot>): StoreSnapshot {
-  const merged: StoreSnapshot = {
-    ...EMPTY_SNAPSHOT,
-    ...omitUndefined(data),
-    author: data.author ?? { ...DEFAULT_AUTHOR },
-  };
-  return {
-    ...merged,
-    currentBoardId: data.currentBoardId ?? merged.boards[0]?.id ?? null,
-  };
-}
+export function filledSnapshot(data: Partial<StoreSnapshot>): StoreSnapshot {}
 
killedBy: domain invariants round-trips a snapshot without IO
statusReason: Property failed after 1 tests
{ seed: 114322173, path: "0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["!",false]
Shrunk 6 time(s)
Got TypeError: Cannot read properties of undefined (reading 'boards')

[Killed] LogicalOperator
src/domain/snapshot.ts:28:13
   const merged: StoreSnapshot = {
     ...EMPTY_SNAPSHOT,
     ...omitUndefined(data),
-    author: data.author ?? { ...DEFAULT_AUTHOR },
+    author: data.author && {
+  ...DEFAULT_AUTHOR
+},
   };
   return {
killedBy: store policy resets to an empty snapshot without dropping the default author
statusReason: expected undefined to deeply equal { id: 'author-1', …(2) }

[Killed] LogicalOperator
src/domain/snapshot.ts:32:21
   };
   return {
     ...merged,
-    currentBoardId: data.currentBoardId ?? merged.boards[0]?.id ?? null,
+    currentBoardId: (data.currentBoardId ?? merged.boards[0]?.id) && null,
   };
 }
killedBy: store policy resets to an empty snapshot without dropping the default author
statusReason: expected undefined to be null

[Killed] OptionalChaining
src/domain/snapshot.ts:32:44
   };
   return {
     ...merged,
-    currentBoardId: data.currentBoardId ?? merged.boards[0]?.id ?? null,
+    currentBoardId: data.currentBoardId ?? merged.boards[0].id ?? null,
   };
 }
killedBy: store policy resets to an empty snapshot without dropping the default author
statusReason: Cannot read properties of undefined (reading 'id')
