[Killed] ArrayDeclaration
src/domain/store.ts:26:21
 } from "./types";
 
 export class GaotaiStore {
-  boards: Board[] = [];
+  boards: Board[] = ["Stryker was here"];
   folders: Folder[] = [];
   files: MaterialFile[] = [];
killedBy: store policy uses default names and the specified author id as board owner
statusReason: expected undefined to be 'author-1' // Object.is equality

[Killed] ArrayDeclaration
src/domain/store.ts:28:27
 export class GaotaiStore {
   boards: Board[] = [];
   folders: Folder[] = [];
-  files: MaterialFile[] = [];
+  files: MaterialFile[] = ["Stryker was here"];
   highlights: Highlight[] = [];
   tasks: Task[] = [];
killedBy: store policy deletes only the target board's files, highlights, tasks, folders and shares
statusReason: expected [ undefined, 'file-9oodoig7-msraeqeg' ] to deeply equal [ 'file-9oodoig7-msraeqeg' ]

[Killed] ObjectLiteral
src/domain/store.ts:33:20
   tasks: Task[] = [];
   shareLinks: ShareLink[] = [];
   currentBoardId: string | null = null;
-  author: Author = { ...DEFAULT_AUTHOR };
+  author: Author = {};
 
   snapshot(): StoreSnapshot {
killedBy: store policy uses default names and the specified author id as board owner
statusReason: expected undefined to be 'author-1' // Object.is equality

[Killed] BlockStatement
src/domain/store.ts:35:29
   currentBoardId: string | null = null;
   author: Author = { ...DEFAULT_AUTHOR };
 
-  snapshot(): StoreSnapshot {
-    return {
-      boards: this.boards,
-      folders: this.folders,
-      files: this.files,
-      highlights: this.highlights,
-      tasks: this.tasks,
-      shareLinks: this.shareLinks,
-      currentBoardId: this.currentBoardId,
-      author: this.author,
-    };
-  }
+  snapshot(): StoreSnapshot {}
 
   load(data: Partial<StoreSnapshot>) {
killedBy: domain invariants round-trips a snapshot without IO
statusReason: Property failed after 1 tests
{ seed: 1781161246, path: "0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["!",false]
Shrunk 9 time(s)
Got SyntaxError: "undefined" is not valid JSON

[Killed] BlockStatement
src/domain/store.ts:48:38
     };
   }
 
-  load(data: Partial<StoreSnapshot>) {
-    const next = filledSnapshot(data);
-    this.boards = next.boards;
-    this.folders = next.folders;
-    this.files = next.files;
-    this.highlights = next.highlights;
-    this.tasks = next.tasks;
-    this.shareLinks = next.shareLinks;
-    this.currentBoardId = next.currentBoardId;
-    this.author = next.author;
-  }
+  load(data: Partial<StoreSnapshot>) {}
 
   reset() {
killedBy: domain invariants round-trips a snapshot without IO
statusReason: Property failed after 1 tests
{ seed: 2099201995, path: "0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["!",false]
Shrunk 6 time(s)
Got AssertionError: expected [] to deeply equal [ 'board-kn9tczmu-msraeqy5' ]

[Killed] BlockStatement
src/domain/store.ts:60:11
     this.author = next.author;
   }
 
-  reset() {
-    this.load({});
-  }
+  reset() {}
 
   createBoard(name = "未命名 Board"): Board {
killedBy: store policy resets to an empty snapshot without dropping the default author
statusReason: expected [ { …(5) } ] to deeply equal []

[Killed] BlockStatement
src/domain/store.ts:64:42
     this.load({});
   }
 
-  createBoard(name = "未命名 Board"): Board {
-    const board: Board = {
-      id: createId("board"),
-      name,
-      ownerId: this.author.id,
-      archived: false,
-      createdAt: new Date().toISOString(),
-    };
-    this.boards.push(board);
-    this.currentBoardId = board.id;
-    return board;
-  }
+  createBoard(name = "未命名 Board"): Board {}
 
   renameBoard(id: string, name: string): Board {
killedBy: domain invariants never lets one write overwrite another, including the same genre twice
statusReason: Property failed after 1 tests
{ seed: -1257746554, path: "0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["长文","长文","!"]
Shrunk 10 time(s)
Got TypeError: Cannot read properties of undefined (reading 'id')

[Killed] BooleanLiteral
src/domain/store.ts:69:17
       id: createId("board"),
       name,
       ownerId: this.author.id,
-      archived: false,
+      archived: true,
       createdAt: new Date().toISOString(),
     };
killedBy: store policy uses prefixed ids and default flags on new records
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/domain/store.ts:77:48
     return board;
   }
 
-  renameBoard(id: string, name: string): Board {
-    const board = this.requireBoard(id);
-    board.name = name;
-    return board;
-  }
+  renameBoard(id: string, name: string): Board {}
 
   deleteBoard(id: string) {
killedBy: Board renames a board
statusReason: expected '旧名' to be '新名称' // Object.is equality

[Killed] BlockStatement
src/domain/store.ts:83:27
     return board;
   }
 
-  deleteBoard(id: string) {
-    this.boards = this.boards.filter((b) => b.id !== id);
-    this.files = this.files.filter((f) => f.boardId !== id);
-    this.highlights = this.highlights.filter((h) => h.boardId !== id);
-    this.tasks = this.tasks.filter((t) => t.boardId !== id);
-    this.folders = this.folders.filter((f) => f.boardId !== id);
-    this.shareLinks = this.shareLinks.filter((s) => s.boardId !== id);
-    if (this.currentBoardId === id) {
-      this.currentBoardId = this.boards[0]?.id ?? null;
-    }
-  }
+  deleteBoard(id: string) {}
 
   setCurrentBoard(id: string) {
killedBy: store policy moves current board to the remaining first board, or null
statusReason: expected 'board-u1gk9x4p-msraermz' to be 'board-rzpvss17-msraermz' // Object.is equality

[Killed] MethodExpression
src/domain/store.ts:84:19
   }
 
   deleteBoard(id: string) {
-    this.boards = this.boards.filter((b) => b.id !== id);
+    this.boards = this.boards;
     this.files = this.files.filter((f) => f.boardId !== id);
     this.highlights = this.highlights.filter((h) => h.boardId !== id);
killedBy: store policy moves current board to the remaining first board, or null
statusReason: expected 'board-xfp4r4m2-msraerq8' to be 'board-8dxg6612-msraerq8' // Object.is equality

[Killed] ConditionalExpression
src/domain/store.ts:84:45
   }
 
   deleteBoard(id: string) {
-    this.boards = this.boards.filter((b) => b.id !== id);
+    this.boards = this.boards.filter((b) => false);
     this.files = this.files.filter((f) => f.boardId !== id);
     this.highlights = this.highlights.filter((h) => h.boardId !== id);
killedBy: store policy moves current board to the remaining first board, or null
statusReason: expected null to be 'board-lbufw31q-msraerzz' // Object.is equality

[Killed] EqualityOperator
src/domain/store.ts:85:43
 
   deleteBoard(id: string) {
     this.boards = this.boards.filter((b) => b.id !== id);
-    this.files = this.files.filter((f) => f.boardId !== id);
+    this.files = this.files.filter((f) => f.boardId === id);
     this.highlights = this.highlights.filter((h) => h.boardId !== id);
     this.tasks = this.tasks.filter((t) => t.boardId !== id);
killedBy: store policy deletes only the target board's files, highlights, tasks, folders and shares
statusReason: expected [ 'file-etde163i-msraesbi' ] to deeply equal [ 'file-gnws13ln-msraesbi' ]

[Killed] MethodExpression
src/domain/store.ts:85:18
 
   deleteBoard(id: string) {
     this.boards = this.boards.filter((b) => b.id !== id);
-    this.files = this.files.filter((f) => f.boardId !== id);
+    this.files = this.files;
     this.highlights = this.highlights.filter((h) => h.boardId !== id);
     this.tasks = this.tasks.filter((t) => t.boardId !== id);
killedBy: store policy deletes only the target board's files, highlights, tasks, folders and shares
statusReason: expected [ 'file-jnos1z2i-msraes4v', …(1) ] to deeply equal [ 'file-jnos1z2i-msraes4v' ]

[Killed] EqualityOperator
src/domain/store.ts:86:53
   deleteBoard(id: string) {
     this.boards = this.boards.filter((b) => b.id !== id);
     this.files = this.files.filter((f) => f.boardId !== id);
-    this.highlights = this.highlights.filter((h) => h.boardId !== id);
+    this.highlights = this.highlights.filter((h) => h.boardId === id);
     this.tasks = this.tasks.filter((t) => t.boardId !== id);
     this.folders = this.folders.filter((f) => f.boardId !== id);
killedBy: store policy deletes only the target board's files, highlights, tasks, folders and shares
statusReason: expected [ 'hl-dnjqytc9-msraesjj' ] to deeply equal [ 'hl-nyydet9j-msraesjj' ]

[Killed] ArrowFunction
src/domain/store.ts:86:46
   deleteBoard(id: string) {
     this.boards = this.boards.filter((b) => b.id !== id);
     this.files = this.files.filter((f) => f.boardId !== id);
-    this.highlights = this.highlights.filter((h) => h.boardId !== id);
+    this.highlights = this.highlights.filter(() => undefined);
     this.tasks = this.tasks.filter((t) => t.boardId !== id);
     this.folders = this.folders.filter((f) => f.boardId !== id);
killedBy: store policy deletes only the target board's files, highlights, tasks, folders and shares
statusReason: expected [] to deeply equal [ 'hl-muuzmels-msraeset' ]

[Killed] ConditionalExpression
src/domain/store.ts:87:43
     this.boards = this.boards.filter((b) => b.id !== id);
     this.files = this.files.filter((f) => f.boardId !== id);
     this.highlights = this.highlights.filter((h) => h.boardId !== id);
-    this.tasks = this.tasks.filter((t) => t.boardId !== id);
+    this.tasks = this.tasks.filter((t) => false);
     this.folders = this.folders.filter((f) => f.boardId !== id);
     this.shareLinks = this.shareLinks.filter((s) => s.boardId !== id);
killedBy: store policy deletes only the target board's files, highlights, tasks, folders and shares
statusReason: expected [] to deeply equal [ 'task-ebg0u7tf-msraesq2' ]

[Killed] MethodExpression
src/domain/store.ts:87:18
     this.boards = this.boards.filter((b) => b.id !== id);
     this.files = this.files.filter((f) => f.boardId !== id);
     this.highlights = this.highlights.filter((h) => h.boardId !== id);
-    this.tasks = this.tasks.filter((t) => t.boardId !== id);
+    this.tasks = this.tasks;
     this.folders = this.folders.filter((f) => f.boardId !== id);
     this.shareLinks = this.shareLinks.filter((s) => s.boardId !== id);
killedBy: store policy deletes only the target board's files, highlights, tasks, folders and shares
statusReason: expected [ 'task-hi90m0l3-msraesl9', …(1) ] to deeply equal [ 'task-hi90m0l3-msraesl9' ]

[Killed] EqualityOperator
src/domain/store.ts:88:47
     this.files = this.files.filter((f) => f.boardId !== id);
     this.highlights = this.highlights.filter((h) => h.boardId !== id);
     this.tasks = this.tasks.filter((t) => t.boardId !== id);
-    this.folders = this.folders.filter((f) => f.boardId !== id);
+    this.folders = this.folders.filter((f) => f.boardId === id);
     this.shareLinks = this.shareLinks.filter((s) => s.boardId !== id);
     if (this.currentBoardId === id) {
killedBy: store policy deletes only the target board's files, highlights, tasks, folders and shares
statusReason: expected [ 'folder-3h18iigp-msraeszs' ] to deeply equal [ 'folder-uoo7mai8-msraeszs' ]

[Killed] MethodExpression
src/domain/store.ts:88:20
     this.files = this.files.filter((f) => f.boardId !== id);
     this.highlights = this.highlights.filter((h) => h.boardId !== id);
     this.tasks = this.tasks.filter((t) => t.boardId !== id);
-    this.folders = this.folders.filter((f) => f.boardId !== id);
+    this.folders = this.folders;
     this.shareLinks = this.shareLinks.filter((s) => s.boardId !== id);
     if (this.currentBoardId === id) {
killedBy: store policy deletes only the target board's files, highlights, tasks, folders and shares
statusReason: expected [ 'folder-2pgz2lnz-msraestb', …(1) ] to deeply equal [ 'folder-2pgz2lnz-msraestb' ]

[Killed] EqualityOperator
src/domain/store.ts:89:53
     this.highlights = this.highlights.filter((h) => h.boardId !== id);
     this.tasks = this.tasks.filter((t) => t.boardId !== id);
     this.folders = this.folders.filter((f) => f.boardId !== id);
-    this.shareLinks = this.shareLinks.filter((s) => s.boardId !== id);
+    this.shareLinks = this.shareLinks.filter((s) => s.boardId === id);
     if (this.currentBoardId === id) {
       this.currentBoardId = this.boards[0]?.id ?? null;
killedBy: store policy deletes only the target board's files, highlights, tasks, folders and shares
statusReason: expected [ 'share-ywzev6jw-msraet8f' ] to deeply equal [ 'share-n0t5e5lh-msraet8f' ]

[Killed] MethodExpression
src/domain/store.ts:89:23
     this.highlights = this.highlights.filter((h) => h.boardId !== id);
     this.tasks = this.tasks.filter((t) => t.boardId !== id);
     this.folders = this.folders.filter((f) => f.boardId !== id);
-    this.shareLinks = this.shareLinks.filter((s) => s.boardId !== id);
+    this.shareLinks = this.shareLinks;
     if (this.currentBoardId === id) {
       this.currentBoardId = this.boards[0]?.id ?? null;
killedBy: store policy deletes only the target board's files, highlights, tasks, folders and shares
statusReason: expected [ 'share-jicop5jp-msraet1v', …(1) ] to deeply equal [ 'share-jicop5jp-msraet1v' ]

[Killed] ConditionalExpression
src/domain/store.ts:90:9
     this.tasks = this.tasks.filter((t) => t.boardId !== id);
     this.folders = this.folders.filter((f) => f.boardId !== id);
     this.shareLinks = this.shareLinks.filter((s) => s.boardId !== id);
-    if (this.currentBoardId === id) {
+    if (true) {
       this.currentBoardId = this.boards[0]?.id ?? null;
     }
killedBy: store policy moves current board to the remaining first board, or null
statusReason: expected 'board-4wp1jofv-msraet9h' to be 'board-jukc4lo7-msraet9h' // Object.is equality

[Killed] ConditionalExpression
src/domain/store.ts:90:9
     this.tasks = this.tasks.filter((t) => t.boardId !== id);
     this.folders = this.folders.filter((f) => f.boardId !== id);
     this.shareLinks = this.shareLinks.filter((s) => s.boardId !== id);
-    if (this.currentBoardId === id) {
+    if (false) {
       this.currentBoardId = this.boards[0]?.id ?? null;
     }
killedBy: store policy moves current board to the remaining first board, or null
statusReason: expected 'board-cvry84fa-msraetbq' to be 'board-8dpq54pd-msraetbq' // Object.is equality

[Killed] LogicalOperator
src/domain/store.ts:91:29
     this.folders = this.folders.filter((f) => f.boardId !== id);
     this.shareLinks = this.shareLinks.filter((s) => s.boardId !== id);
     if (this.currentBoardId === id) {
-      this.currentBoardId = this.boards[0]?.id ?? null;
+      this.currentBoardId = this.boards[0]?.id && null;
     }
   }
killedBy: store policy moves current board to the remaining first board, or null
statusReason: expected null to be 'board-4hdv10mx-msraetg6' // Object.is equality

[Killed] OptionalChaining
src/domain/store.ts:91:29
     this.folders = this.folders.filter((f) => f.boardId !== id);
     this.shareLinks = this.shareLinks.filter((s) => s.boardId !== id);
     if (this.currentBoardId === id) {
-      this.currentBoardId = this.boards[0]?.id ?? null;
+      this.currentBoardId = this.boards[0].id ?? null;
     }
   }
killedBy: store policy moves current board to the remaining first board, or null
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/domain/store.ts:95:31
     }
   }
 
-  setCurrentBoard(id: string) {
-    this.requireBoard(id);
-    this.currentBoardId = id;
-  }
+  setCurrentBoard(id: string) {}
 
   requireBoard(id: string): Board {
killedBy: store policy ensureBoard returns the current board, or adopts the first, or throws
statusReason: expected 'board-3a2srnuz-msraetjf' to be 'board-nkcvccan-msraetjf' // Object.is equality

[Killed] BlockStatement
src/domain/store.ts:100:35
     this.currentBoardId = id;
   }
 
-  requireBoard(id: string): Board {
-    const board = this.boards.find((b) => b.id === id);
-    if (!board) throw new Error("Board 不存在");
-    return board;
-  }
+  requireBoard(id: string): Board {}
 
   ensureBoard(): Board {
killedBy: store policy ensureBoard returns the current board, or adopts the first, or throws
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/domain/store.ts:101:43
   }
 
   requireBoard(id: string): Board {
-    const board = this.boards.find((b) => b.id === id);
+    const board = this.boards.find((b) => true);
     if (!board) throw new Error("Board 不存在");
     return board;
killedBy: store policy ensureBoard keeps the second board when it is current
statusReason: expected 'board-t9rkmusc-msraetow' to be 'board-k0kzqd09-msraetow' // Object.is equality

[Killed] ConditionalExpression
src/domain/store.ts:101:43
   }
 
   requireBoard(id: string): Board {
-    const board = this.boards.find((b) => b.id === id);
+    const board = this.boards.find((b) => false);
     if (!board) throw new Error("Board 不存在");
     return board;
killedBy: store policy ensureBoard returns the current board, or adopts the first, or throws
statusReason: Board 不存在

[Killed] ConditionalExpression
src/domain/store.ts:102:9
 
   requireBoard(id: string): Board {
     const board = this.boards.find((b) => b.id === id);
-    if (!board) throw new Error("Board 不存在");
+    if (false) throw new Error("Board 不存在");
     return board;
   }
killedBy: store policy throws the specified missing-entity errors
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/domain/store.ts:102:9
 
   requireBoard(id: string): Board {
     const board = this.boards.find((b) => b.id === id);
-    if (!board) throw new Error("Board 不存在");
+    if (board) throw new Error("Board 不存在");
     return board;
   }
killedBy: store policy ensureBoard returns the current board, or adopts the first, or throws
statusReason: Board 不存在

[Killed] BlockStatement
src/domain/store.ts:106:24
     return board;
   }
 
-  ensureBoard(): Board {
-    if (this.currentBoardId) return this.requireBoard(this.currentBoardId);
-    if (this.boards[0]) {
-      this.currentBoardId = this.boards[0].id;
-      return this.boards[0];
-    }
-    throw new Error("须先创建或选择一个 Board 才能继续");
-  }
+  ensureBoard(): Board {}
 
   addLink(boardId: string, url: string): MaterialFile {
killedBy: store policy ensureBoard returns the current board, or adopts the first, or throws
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/domain/store.ts:107:9
   }
 
   ensureBoard(): Board {
-    if (this.currentBoardId) return this.requireBoard(this.currentBoardId);
+    if (true) return this.requireBoard(this.currentBoardId);
     if (this.boards[0]) {
       this.currentBoardId = this.boards[0].id;
killedBy: store policy ensureBoard returns the current board, or adopts the first, or throws
statusReason: expected [Function] to throw error including '须先创建或选择一个 Board 才能继续' but got 'Board 不存在'

[Killed] ConditionalExpression
src/domain/store.ts:107:9
   }
 
   ensureBoard(): Board {
-    if (this.currentBoardId) return this.requireBoard(this.currentBoardId);
+    if (false) return this.requireBoard(this.currentBoardId);
     if (this.boards[0]) {
       this.currentBoardId = this.boards[0].id;
killedBy: store policy ensureBoard keeps the second board when it is current
statusReason: expected 'board-m0ftobf0-msraeu2x' to be 'board-f883wwa1-msraeu2x' // Object.is equality

[Killed] ConditionalExpression
src/domain/store.ts:108:9
 
   ensureBoard(): Board {
     if (this.currentBoardId) return this.requireBoard(this.currentBoardId);
-    if (this.boards[0]) {
+    if (true) {
       this.currentBoardId = this.boards[0].id;
       return this.boards[0];
killedBy: store policy ensureBoard returns the current board, or adopts the first, or throws
statusReason: expected [Function] to throw error including '须先创建或选择一个 Board 才能继续' but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
src/domain/store.ts:108:25
 
   ensureBoard(): Board {
     if (this.currentBoardId) return this.requireBoard(this.currentBoardId);
-    if (this.boards[0]) {
-      this.currentBoardId = this.boards[0].id;
-      return this.boards[0];
-    }
+    if (this.boards[0]) {}
     throw new Error("须先创建或选择一个 Board 才能继续");
   }
killedBy: store policy ensureBoard returns the current board, or adopts the first, or throws
statusReason: 须先创建或选择一个 Board 才能继续

[Killed] BlockStatement
src/domain/store.ts:115:55
     throw new Error("须先创建或选择一个 Board 才能继续");
   }
 
-  addLink(boardId: string, url: string): MaterialFile {
-    const preview = linkPreview(url);
-    return this.pushFile({ boardId, ...preview, url });
-  }
+  addLink(boardId: string, url: string): MaterialFile {}
 
   addLocalFile(
killedBy: Task chat answers from selected files and highlights and cites them
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/domain/store.ts:124:19
     boardId: string,
     name: string,
     options: { mime?: string; dataUrl?: string; body?: string } = {},
-  ): MaterialFile {
-    const kind = classifyLocalName(name, options.mime);
-    const file = this.pushFile({
-      boardId,
-      kind,
-      title: name,
-      body: localFileBody(name, kind, options.body),
-      mime: options.mime,
-      dataUrl: options.dataUrl,
-    });
-    return attachMediaTranscript(file);
-  }
+  ): MaterialFile {}
 
   addDocument(boardId: string, title = "未命名文档", body = ""): MaterialFile {
killedBy: store policy attaches transcripts only to audio and video
statusReason: Cannot read properties of undefined (reading 'transcription')

[Killed] BlockStatement
src/domain/store.ts:137:74
     return attachMediaTranscript(file);
   }
 
-  addDocument(boardId: string, title = "未命名文档", body = ""): MaterialFile {
-    return this.pushFile({ boardId, kind: "document", title, body });
-  }
+  addDocument(boardId: string, title = "未命名文档", body = ""): MaterialFile {}
 
   private pushFile(partial: {
killedBy: store policy uses default names and the specified author id as board owner
statusReason: Cannot read properties of undefined (reading 'title')

[Killed] StringLiteral
src/domain/store.ts:138:43
   }
 
   addDocument(boardId: string, title = "未命名文档", body = ""): MaterialFile {
-    return this.pushFile({ boardId, kind: "document", title, body });
+    return this.pushFile({ boardId, kind: "", title, body });
   }
 
killedBy: File / sources creates an editable document without a separate note object
statusReason: expected '' to be 'document' // Object.is equality

[Killed] BlockStatement
src/domain/store.ts:152:20
     writeGenre?: WriteGenre;
     sourceFileIds?: string[];
     sourceHighlightIds?: string[];
-  }): MaterialFile {
-    const file: MaterialFile = {
-      id: createId("file"),
-      folderId: null,
-      selected: false,
-      sourceFileIds: [],
-      sourceHighlightIds: [],
-      createdAt: new Date().toISOString(),
-      ...partial,
-    };
-    this.files.push(file);
-    return file;
-  }
+  }): MaterialFile {}
 
   updateFile(id: string, patch: Partial<Pick<MaterialFile, "title" | "body" | "selected" | "folderId">>) {
killedBy: store policy uses default names and the specified author id as board owner
statusReason: Cannot read properties of undefined (reading 'title')

[Killed] StringLiteral
src/domain/store.ts:154:20
     sourceHighlightIds?: string[];
   }): MaterialFile {
     const file: MaterialFile = {
-      id: createId("file"),
+      id: createId(""),
       folderId: null,
       selected: false,
killedBy: store policy uses prefixed ids and default flags on new records
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/domain/store.ts:156:17
     const file: MaterialFile = {
       id: createId("file"),
       folderId: null,
-      selected: false,
+      selected: true,
       sourceFileIds: [],
       sourceHighlightIds: [],
killedBy: store policy scopes write sources and chat cites to the current board
statusReason: expected true to be false // Object.is equality

[Killed] ArrayDeclaration
src/domain/store.ts:157:22
       id: createId("file"),
       folderId: null,
       selected: false,
-      sourceFileIds: [],
+      sourceFileIds: ["Stryker was here"],
       sourceHighlightIds: [],
       createdAt: new Date().toISOString(),
killedBy: store policy uses prefixed ids and default flags on new records
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BlockStatement
src/domain/store.ts:166:106
     return file;
   }
 
-  updateFile(id: string, patch: Partial<Pick<MaterialFile, "title" | "body" | "selected" | "folderId">>) {
-    const file = this.requireFile(id);
-    assignDefined(file, patch);
-    return file;
-  }
+  updateFile(id: string, patch: Partial<Pick<MaterialFile, "title" | "body" | "selected" | "folderId">>) {}
 
   requireFile(id: string): MaterialFile {
killedBy: File / sources does not wipe title when only toggling selected
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/domain/store.ts:172:41
     return file;
   }
 
-  requireFile(id: string): MaterialFile {
-    const file = this.files.find((f) => f.id === id);
-    if (!file) throw new Error("File 不存在");
-    return file;
-  }
+  requireFile(id: string): MaterialFile {}
 
   addHighlight(fileId: string, text: string): Highlight {
killedBy: store policy throws the specified missing-entity errors
statusReason: expected [Function] to throw an error

[Killed] ArrowFunction
src/domain/store.ts:173:34
   }
 
   requireFile(id: string): MaterialFile {
-    const file = this.files.find((f) => f.id === id);
+    const file = this.files.find(() => undefined);
     if (!file) throw new Error("File 不存在");
     return file;
killedBy: File / sources puts a file in a folder while ungrouped files stay visible
statusReason: File 不存在

[Killed] EqualityOperator
src/domain/store.ts:173:41
   }
 
   requireFile(id: string): MaterialFile {
-    const file = this.files.find((f) => f.id === id);
+    const file = this.files.find((f) => f.id !== id);
     if (!file) throw new Error("File 不存在");
     return file;
killedBy: store policy assignDefined writes empty strings and false, but skips undefined
statusReason: File 不存在

[Killed] ConditionalExpression
src/domain/store.ts:174:9
 
   requireFile(id: string): MaterialFile {
     const file = this.files.find((f) => f.id === id);
-    if (!file) throw new Error("File 不存在");
+    if (true) throw new Error("File 不存在");
     return file;
   }
killedBy: store policy assignDefined writes empty strings and false, but skips undefined
statusReason: File 不存在

[Killed] BooleanLiteral
src/domain/store.ts:174:9
 
   requireFile(id: string): MaterialFile {
     const file = this.files.find((f) => f.id === id);
-    if (!file) throw new Error("File 不存在");
+    if (file) throw new Error("File 不存在");
     return file;
   }
killedBy: File / sources puts a file in a folder while ungrouped files stay visible
statusReason: File 不存在

[Killed] BlockStatement
src/domain/store.ts:178:57
     return file;
   }
 
-  addHighlight(fileId: string, text: string): Highlight {
-    const file = this.requireFile(fileId);
-    const highlight: Highlight = {
-      id: createId("hl"),
-      fileId,
-      boardId: file.boardId,
-      text,
-      selected: true,
-    };
-    this.highlights.push(highlight);
-    return highlight;
-  }
+  addHighlight(fileId: string, text: string): Highlight {}
 
   toggleHighlight(id: string, selected?: boolean): Highlight {
killedBy: store policy toggles highlight when selected is omitted, and honors an explicit flag
statusReason: Cannot read properties of undefined (reading 'selected')

[Killed] BooleanLiteral
src/domain/store.ts:185:17
       fileId,
       boardId: file.boardId,
       text,
-      selected: true,
+      selected: false,
     };
     this.highlights.push(highlight);
killedBy: store policy toggles highlight when selected is omitted, and honors an explicit flag
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/domain/store.ts:191:62
     return highlight;
   }
 
-  toggleHighlight(id: string, selected?: boolean): Highlight {
-    const highlight = this.highlights.find((h) => h.id === id);
-    if (!highlight) throw new Error("高亮不存在");
-    highlight.selected = selected ?? !highlight.selected;
-    return highlight;
-  }
+  toggleHighlight(id: string, selected?: boolean): Highlight {}
 
   createFolder(boardId: string, name = "新文件夹"): Folder {
killedBy: store policy throws the specified missing-entity errors
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/domain/store.ts:192:51
   }
 
   toggleHighlight(id: string, selected?: boolean): Highlight {
-    const highlight = this.highlights.find((h) => h.id === id);
+    const highlight = this.highlights.find((h) => h.id !== id);
     if (!highlight) throw new Error("高亮不存在");
     highlight.selected = selected ?? !highlight.selected;
killedBy: store policy toggles highlight when selected is omitted, and honors an explicit flag
statusReason: 高亮不存在

[Killed] ConditionalExpression
src/domain/store.ts:192:51
   }
 
   toggleHighlight(id: string, selected?: boolean): Highlight {
-    const highlight = this.highlights.find((h) => h.id === id);
+    const highlight = this.highlights.find((h) => false);
     if (!highlight) throw new Error("高亮不存在");
     highlight.selected = selected ?? !highlight.selected;
killedBy: store policy toggles highlight when selected is omitted, and honors an explicit flag
statusReason: 高亮不存在
