[Killed] ConditionalExpression
src/domain/store.ts:193:9
 
   toggleHighlight(id: string, selected?: boolean): Highlight {
     const highlight = this.highlights.find((h) => h.id === id);
-    if (!highlight) throw new Error("高亮不存在");
+    if (true) throw new Error("高亮不存在");
     highlight.selected = selected ?? !highlight.selected;
     return highlight;
killedBy: store policy toggles highlight when selected is omitted, and honors an explicit flag
statusReason: 高亮不存在

[Killed] BooleanLiteral
src/domain/store.ts:193:9
 
   toggleHighlight(id: string, selected?: boolean): Highlight {
     const highlight = this.highlights.find((h) => h.id === id);
-    if (!highlight) throw new Error("高亮不存在");
+    if (highlight) throw new Error("高亮不存在");
     highlight.selected = selected ?? !highlight.selected;
     return highlight;
killedBy: domain invariants omits unchecked files and highlights from generated sources
statusReason: Property failed after 1 tests
{ seed: -655910208, path: "0:0:0", endOnFailure: true }
Counterexample: [[false],"长文"]
Shrunk 2 time(s)
Got error: 高亮不存在

[Killed] BooleanLiteral
src/domain/store.ts:194:38
   toggleHighlight(id: string, selected?: boolean): Highlight {
     const highlight = this.highlights.find((h) => h.id === id);
     if (!highlight) throw new Error("高亮不存在");
-    highlight.selected = selected ?? !highlight.selected;
+    highlight.selected = selected ?? highlight.selected;
     return highlight;
   }
killedBy: store policy toggles highlight when selected is omitted, and honors an explicit flag
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/domain/store.ts:194:26
   toggleHighlight(id: string, selected?: boolean): Highlight {
     const highlight = this.highlights.find((h) => h.id === id);
     if (!highlight) throw new Error("高亮不存在");
-    highlight.selected = selected ?? !highlight.selected;
+    highlight.selected = selected && !highlight.selected;
     return highlight;
   }
killedBy: store policy toggles highlight when selected is omitted, and honors an explicit flag
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/domain/store.ts:198:56
     return highlight;
   }
 
-  createFolder(boardId: string, name = "新文件夹"): Folder {
-    const folder: Folder = { id: createId("folder"), boardId, name };
-    this.folders.push(folder);
-    return folder;
-  }
+  createFolder(boardId: string, name = "新文件夹"): Folder {}
 
   moveFileToFolder(fileId: string, folderId: string | null) {
killedBy: store policy uses default names and the specified author id as board owner
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] StringLiteral
src/domain/store.ts:198:40
     return highlight;
   }
 
-  createFolder(boardId: string, name = "新文件夹"): Folder {
+  createFolder(boardId: string, name = ""): Folder {
     const folder: Folder = { id: createId("folder"), boardId, name };
     this.folders.push(folder);
killedBy: store policy uses default names and the specified author id as board owner
statusReason: expected '' to be '新文件夹' // Object.is equality

[Killed] BlockStatement
src/domain/store.ts:204:61
     return folder;
   }
 
-  moveFileToFolder(fileId: string, folderId: string | null) {
-    const file = this.requireFile(fileId);
-    if (folderId) {
-      const folder = this.folders.find((f) => f.id === folderId);
-      if (!folder) throw new Error("文件夹不存在");
-    }
-    file.folderId = folderId;
-    return file;
-  }
+  moveFileToFolder(fileId: string, folderId: string | null) {}
 
   setTranscription(fileId: string, outcome: "success" | "failed") {
killedBy: store policy ungroups a file with null and rejects a missing folder
statusReason: expected null to be 'folder-lfyp15sy-msraewwt' // Object.is equality

[Killed] ConditionalExpression
src/domain/store.ts:206:9
 
   moveFileToFolder(fileId: string, folderId: string | null) {
     const file = this.requireFile(fileId);
-    if (folderId) {
+    if (false) {
       const folder = this.folders.find((f) => f.id === folderId);
       if (!folder) throw new Error("文件夹不存在");
killedBy: store policy ungroups a file with null and rejects a missing folder
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/domain/store.ts:206:19
 
   moveFileToFolder(fileId: string, folderId: string | null) {
     const file = this.requireFile(fileId);
-    if (folderId) {
-      const folder = this.folders.find((f) => f.id === folderId);
-      if (!folder) throw new Error("文件夹不存在");
-    }
+    if (folderId) {}
     file.folderId = folderId;
     return file;
killedBy: store policy ungroups a file with null and rejects a missing folder
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/domain/store.ts:207:47
   moveFileToFolder(fileId: string, folderId: string | null) {
     const file = this.requireFile(fileId);
     if (folderId) {
-      const folder = this.folders.find((f) => f.id === folderId);
+      const folder = this.folders.find((f) => false);
       if (!folder) throw new Error("文件夹不存在");
     }
killedBy: store policy ungroups a file with null and rejects a missing folder
statusReason: 文件夹不存在

[Killed] EqualityOperator
src/domain/store.ts:207:47
   moveFileToFolder(fileId: string, folderId: string | null) {
     const file = this.requireFile(fileId);
     if (folderId) {
-      const folder = this.folders.find((f) => f.id === folderId);
+      const folder = this.folders.find((f) => f.id !== folderId);
       if (!folder) throw new Error("文件夹不存在");
     }
killedBy: store policy ungroups a file with null and rejects a missing folder
statusReason: 文件夹不存在

[Killed] BooleanLiteral
src/domain/store.ts:208:11
     const file = this.requireFile(fileId);
     if (folderId) {
       const folder = this.folders.find((f) => f.id === folderId);
-      if (!folder) throw new Error("文件夹不存在");
+      if (folder) throw new Error("文件夹不存在");
     }
     file.folderId = folderId;
killedBy: store policy ungroups a file with null and rejects a missing folder
statusReason: 文件夹不存在

[Killed] ConditionalExpression
src/domain/store.ts:208:11
     const file = this.requireFile(fileId);
     if (folderId) {
       const folder = this.folders.find((f) => f.id === folderId);
-      if (!folder) throw new Error("文件夹不存在");
+      if (false) throw new Error("文件夹不存在");
     }
     file.folderId = folderId;
killedBy: store policy ungroups a file with null and rejects a missing folder
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/domain/store.ts:214:67
     return file;
   }
 
-  setTranscription(fileId: string, outcome: "success" | "failed") {
-    const file = this.requireFile(fileId);
-    file.transcription = fakeTranscription(file, outcome);
-    return file;
-  }
+  setTranscription(fileId: string, outcome: "success" | "failed") {}
 
   startChatTask(boardId: string, title: string): Task {
killedBy: author-action adapter treats only outcome=failed as a failed transcription
statusReason: expected 'success' to be 'failed' // Object.is equality

[Killed] BlockStatement
src/domain/store.ts:220:55
     return file;
   }
 
-  startChatTask(boardId: string, title: string): Task {
-    const task: Task = {
-      id: createId("task"),
-      boardId,
-      title,
-      kind: "chat",
-      messages: [],
-    };
-    this.tasks.push(task);
-    return task;
-  }
+  startChatTask(boardId: string, title: string): Task {}
 
   askChat(taskId: string, question: string, currentFileId?: string): ChatMessage {
killedBy: store policy revises only when both a current file and a revise question are present
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
src/domain/store.ts:225:13
       id: createId("task"),
       boardId,
       title,
-      kind: "chat",
+      kind: "",
       messages: [],
     };
killedBy: store policy scopes write sources and chat cites to the current board
statusReason: expected '' to be 'chat' // Object.is equality

[Killed] BlockStatement
src/domain/store.ts:232:82
     return task;
   }
 
-  askChat(taskId: string, question: string, currentFileId?: string): ChatMessage {
-    const task = this.requireTask(taskId);
-    task.messages.push({ id: createId("msg"), role: "user", text: question });
-    if (currentFileId && isReviseQuestion(question)) {
-      return this.reviseOpenDocument(task, question, currentFileId);
-    }
-    return this.replyFromSources(task, question);
-  }
+  askChat(taskId: string, question: string, currentFileId?: string): ChatMessage {}
 
   generateWrite(boardId: string, genre: WriteGenre): MaterialFile {
killedBy: store policy throws the specified missing-entity errors
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/domain/store.ts:234:39
 
   askChat(taskId: string, question: string, currentFileId?: string): ChatMessage {
     const task = this.requireTask(taskId);
-    task.messages.push({ id: createId("msg"), role: "user", text: question });
+    task.messages.push({ id: createId(""), role: "user", text: question });
     if (currentFileId && isReviseQuestion(question)) {
       return this.reviseOpenDocument(task, question, currentFileId);
killedBy: store policy scopes write sources and chat cites to the current board
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/domain/store.ts:235:54
   askChat(taskId: string, question: string, currentFileId?: string): ChatMessage {
     const task = this.requireTask(taskId);
     task.messages.push({ id: createId("msg"), role: "user", text: question });
-    if (currentFileId && isReviseQuestion(question)) {
-      return this.reviseOpenDocument(task, question, currentFileId);
-    }
+    if (currentFileId && isReviseQuestion(question)) {}
     return this.replyFromSources(task, question);
   }
killedBy: store policy revises only when both a current file and a revise question are present
statusReason: expected '## 引言\n围绕「主题」展开讨论。\n## 分析\n结合已选材料进行分析…' to contain '修订'

[Killed] ConditionalExpression
src/domain/store.ts:235:9
   askChat(taskId: string, question: string, currentFileId?: string): ChatMessage {
     const task = this.requireTask(taskId);
     task.messages.push({ id: createId("msg"), role: "user", text: question });
-    if (currentFileId && isReviseQuestion(question)) {
+    if (true) {
       return this.reviseOpenDocument(task, question, currentFileId);
     }
killedBy: store policy revises only when both a current file and a revise question are present
statusReason: File 不存在

[Killed] BlockStatement
src/domain/store.ts:241:67
     return this.replyFromSources(task, question);
   }
 
-  generateWrite(boardId: string, genre: WriteGenre): MaterialFile {
-    const selectedFiles = this.selectedSourceFiles(boardId);
-    const selectedHighlights = this.selectedHighlightsOn(boardId);
-    const content = generateWriteContent(genre, selectedFiles, selectedHighlights);
-    const file = this.pushFile({
-      boardId,
-      kind: "write",
-      title: content.title,
-      body: content.body,
-      writeGenre: genre,
-      sourceFileIds: selectedFiles.map((f) => f.id),
-      sourceHighlightIds: selectedHighlights.map((h) => h.id),
-    });
-    this.tasks.push({
-      id: createId("task"),
-      boardId,
-      title: `Write · ${genre}`,
-      kind: "write",
-      writeFileId: file.id,
-      messages: [],
-    });
-    return file;
-  }
+  generateWrite(boardId: string, genre: WriteGenre): MaterialFile {}
 
   createShare(fileId: string): ShareLink {
killedBy: store policy omits selected write documents from later write sources
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ArrowFunction
src/domain/store.ts:251:40
       title: content.title,
       body: content.body,
       writeGenre: genre,
-      sourceFileIds: selectedFiles.map((f) => f.id),
+      sourceFileIds: selectedFiles.map(() => undefined),
       sourceHighlightIds: selectedHighlights.map((h) => h.id),
     });
killedBy: store policy omits selected write documents from later write sources
statusReason: expected [ undefined ] to deeply equal [ 'file-mz1of0fs-msraeydp' ]

[Killed] ArrowFunction
src/domain/store.ts:252:50
       body: content.body,
       writeGenre: genre,
       sourceFileIds: selectedFiles.map((f) => f.id),
-      sourceHighlightIds: selectedHighlights.map((h) => h.id),
+      sourceHighlightIds: selectedHighlights.map(() => undefined),
     });
     this.tasks.push({
killedBy: store policy scopes write sources and chat cites to the current board
statusReason: expected [ undefined ] to deeply equal [ 'hl-tl9dus8b-msraeyf5' ]

[Killed] StringLiteral
src/domain/store.ts:255:20
       sourceHighlightIds: selectedHighlights.map((h) => h.id),
     });
     this.tasks.push({
-      id: createId("task"),
+      id: createId(""),
       boardId,
       title: `Write · ${genre}`,
killedBy: store policy uses prefixed ids and default flags on new records
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/domain/store.ts:258:13
       id: createId("task"),
       boardId,
       title: `Write · ${genre}`,
-      kind: "write",
+      kind: "",
       writeFileId: file.id,
       messages: [],
killedBy: store policy scopes write sources and chat cites to the current board
statusReason: expected '' to be 'write' // Object.is equality

[Killed] ArrayDeclaration
src/domain/store.ts:260:17
       title: `Write · ${genre}`,
       kind: "write",
       writeFileId: file.id,
-      messages: [],
+      messages: ["Stryker was here"],
     });
     return file;
killedBy: store policy scopes write sources and chat cites to the current board
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BlockStatement
src/domain/store.ts:265:42
     return file;
   }
 
-  createShare(fileId: string): ShareLink {
-    const file = this.requireFile(fileId);
-    const existing = this.shareLinks.find((s) => s.fileId === fileId);
-    if (existing) return existing;
-    const link: ShareLink = {
-      token: createId("share"),
-      fileId,
-      boardId: file.boardId,
-    };
-    this.shareLinks.push(link);
-    return link;
-  }
+  createShare(fileId: string): ShareLink {}
 
   getShare(token: string): { file: MaterialFile; link: ShareLink } | null {
killedBy: store policy reuses an existing share and returns null for each broken lookup
statusReason: Cannot read properties of undefined (reading 'token')

[Killed] ArrowFunction
src/domain/store.ts:267:43
 
   createShare(fileId: string): ShareLink {
     const file = this.requireFile(fileId);
-    const existing = this.shareLinks.find((s) => s.fileId === fileId);
+    const existing = this.shareLinks.find(() => undefined);
     if (existing) return existing;
     const link: ShareLink = {
killedBy: store policy reuses an existing share and returns null for each broken lookup
statusReason: expected 'share-u2vxag5k-msraeyqx' to be 'share-n0p1e9n5-msraeyqx' // Object.is equality

[Killed] EqualityOperator
src/domain/store.ts:267:50
 
   createShare(fileId: string): ShareLink {
     const file = this.requireFile(fileId);
-    const existing = this.shareLinks.find((s) => s.fileId === fileId);
+    const existing = this.shareLinks.find((s) => s.fileId !== fileId);
     if (existing) return existing;
     const link: ShareLink = {
killedBy: store policy reuses an existing share and returns null for each broken lookup
statusReason: expected 'share-se4uha42-msraeyvg' to be 'share-na1xh1ze-msraeyvg' // Object.is equality

[Killed] ConditionalExpression
src/domain/store.ts:268:9
   createShare(fileId: string): ShareLink {
     const file = this.requireFile(fileId);
     const existing = this.shareLinks.find((s) => s.fileId === fileId);
-    if (existing) return existing;
+    if (true) return existing;
     const link: ShareLink = {
       token: createId("share"),
killedBy: store policy reuses an existing share and returns null for each broken lookup
statusReason: Cannot read properties of undefined (reading 'token')

[Killed] ConditionalExpression
src/domain/store.ts:268:9
   createShare(fileId: string): ShareLink {
     const file = this.requireFile(fileId);
     const existing = this.shareLinks.find((s) => s.fileId === fileId);
-    if (existing) return existing;
+    if (false) return existing;
     const link: ShareLink = {
       token: createId("share"),
killedBy: store policy reuses an existing share and returns null for each broken lookup
statusReason: expected 'share-qipolr58-msraeyyr' to be 'share-pp3opk8k-msraeyyr' // Object.is equality

[Killed] BlockStatement
src/domain/store.ts:278:75
     return link;
   }
 
-  getShare(token: string): { file: MaterialFile; link: ShareLink } | null {
-    const link = this.shareLinks.find((s) => s.token === token);
-    if (!link) return null;
-    const file = this.files.find((f) => f.id === link.fileId);
-    if (!file) return null;
-    if (!this.boards.some((b) => b.id === link.boardId)) return null;
-    return { file, link };
-  }
+  getShare(token: string): { file: MaterialFile; link: ShareLink } | null {}
 
   copyFile(fileId: string): string {
killedBy: store policy reuses an existing share and returns null for each broken lookup
statusReason: expected undefined to be 'file-fti1anim-msraez44' // Object.is equality

[Killed] EqualityOperator
src/domain/store.ts:279:46
   }
 
   getShare(token: string): { file: MaterialFile; link: ShareLink } | null {
-    const link = this.shareLinks.find((s) => s.token === token);
+    const link = this.shareLinks.find((s) => s.token !== token);
     if (!link) return null;
     const file = this.files.find((f) => f.id === link.fileId);
killedBy: store policy reuses an existing share and returns null for each broken lookup
statusReason: expected undefined to be 'file-ai30bqfu-msraeze0' // Object.is equality

[Killed] ConditionalExpression
src/domain/store.ts:279:46
   }
 
   getShare(token: string): { file: MaterialFile; link: ShareLink } | null {
-    const link = this.shareLinks.find((s) => s.token === token);
+    const link = this.shareLinks.find((s) => true);
     if (!link) return null;
     const file = this.files.find((f) => f.id === link.fileId);
killedBy: store policy reuses an existing share and returns null for each broken lookup
statusReason: expected { file: { …(10) }, link: { …(3) } } to be null

[Killed] ConditionalExpression
src/domain/store.ts:280:9
 
   getShare(token: string): { file: MaterialFile; link: ShareLink } | null {
     const link = this.shareLinks.find((s) => s.token === token);
-    if (!link) return null;
+    if (false) return null;
     const file = this.files.find((f) => f.id === link.fileId);
     if (!file) return null;
killedBy: store policy reuses an existing share and returns null for each broken lookup
statusReason: Cannot read properties of undefined (reading 'fileId')

[Killed] BooleanLiteral
src/domain/store.ts:280:9
 
   getShare(token: string): { file: MaterialFile; link: ShareLink } | null {
     const link = this.shareLinks.find((s) => s.token === token);
-    if (!link) return null;
+    if (link) return null;
     const file = this.files.find((f) => f.id === link.fileId);
     if (!file) return null;
killedBy: store policy reuses an existing share and returns null for each broken lookup
statusReason: expected undefined to be 'file-a3jse5vk-msraezgs' // Object.is equality

[Killed] EqualityOperator
src/domain/store.ts:281:41
   getShare(token: string): { file: MaterialFile; link: ShareLink } | null {
     const link = this.shareLinks.find((s) => s.token === token);
     if (!link) return null;
-    const file = this.files.find((f) => f.id === link.fileId);
+    const file = this.files.find((f) => f.id !== link.fileId);
     if (!file) return null;
     if (!this.boards.some((b) => b.id === link.boardId)) return null;
killedBy: store policy reuses an existing share and returns null for each broken lookup
statusReason: expected undefined to be 'file-3gjmj4nj-msraezrh' // Object.is equality

[Killed] ConditionalExpression
src/domain/store.ts:281:41
   getShare(token: string): { file: MaterialFile; link: ShareLink } | null {
     const link = this.shareLinks.find((s) => s.token === token);
     if (!link) return null;
-    const file = this.files.find((f) => f.id === link.fileId);
+    const file = this.files.find((f) => true);
     if (!file) return null;
     if (!this.boards.some((b) => b.id === link.boardId)) return null;
killedBy: Copy and Share creates a per-document share link and invalidates it when the board is deleted
statusReason: expected 'file-gw1ct8oc-msraezve' to be 'file-930hjeeo-msraezvf' // Object.is equality

[Killed] ConditionalExpression
src/domain/store.ts:282:9
     const link = this.shareLinks.find((s) => s.token === token);
     if (!link) return null;
     const file = this.files.find((f) => f.id === link.fileId);
-    if (!file) return null;
+    if (false) return null;
     if (!this.boards.some((b) => b.id === link.boardId)) return null;
     return { file, link };
killedBy: store policy reuses an existing share and returns null for each broken lookup
statusReason: expected { file: undefined, link: { …(3) } } to be null

[Killed] ConditionalExpression
src/domain/store.ts:282:9
     const link = this.shareLinks.find((s) => s.token === token);
     if (!link) return null;
     const file = this.files.find((f) => f.id === link.fileId);
-    if (!file) return null;
+    if (true) return null;
     if (!this.boards.some((b) => b.id === link.boardId)) return null;
     return { file, link };
killedBy: store policy reuses an existing share and returns null for each broken lookup
statusReason: expected undefined to be 'file-8lurb4k5-msraezxw' // Object.is equality

[Killed] ArrowFunction
src/domain/store.ts:283:27
     if (!link) return null;
     const file = this.files.find((f) => f.id === link.fileId);
     if (!file) return null;
-    if (!this.boards.some((b) => b.id === link.boardId)) return null;
+    if (!this.boards.some(() => undefined)) return null;
     return { file, link };
   }
killedBy: store policy reuses an existing share and returns null for each broken lookup
statusReason: expected undefined to be 'file-0031omvo-msraf0ay' // Object.is equality

[Killed] MethodExpression
src/domain/store.ts:283:10
     if (!link) return null;
     const file = this.files.find((f) => f.id === link.fileId);
     if (!file) return null;
-    if (!this.boards.some((b) => b.id === link.boardId)) return null;
+    if (!this.boards.every(b => b.id === link.boardId)) return null;
     return { file, link };
   }
killedBy: store policy reuses an existing share and returns null for each broken lookup
statusReason: expected { file: { …(10) }, link: { …(3) } } to be null

[Killed] BlockStatement
src/domain/store.ts:287:36
     return { file, link };
   }
 
-  copyFile(fileId: string): string {
-    return copyDocumentText(this.requireFile(fileId));
-  }
+  copyFile(fileId: string): string {}
 
   private requireTask(id: string): Task {
killedBy: store policy reuses an existing share and returns null for each broken lookup
statusReason: expected undefined to be '甲\n\n正文' // Object.is equality

[Killed] BlockStatement
src/domain/store.ts:291:41
     return copyDocumentText(this.requireFile(fileId));
   }
 
-  private requireTask(id: string): Task {
-    const task = this.tasks.find((t) => t.id === id);
-    if (!task) throw new Error("Task 不存在");
-    return task;
-  }
+  private requireTask(id: string): Task {}
 
   private selectedSourceFiles(boardId: string) {
killedBy: store policy throws the specified missing-entity errors
statusReason: expected [Function] to throw error including 'Task 不存在' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/domain/store.ts:292:41
   }
 
   private requireTask(id: string): Task {
-    const task = this.tasks.find((t) => t.id === id);
+    const task = this.tasks.find((t) => false);
     if (!task) throw new Error("Task 不存在");
     return task;
killedBy: store policy revises only when both a current file and a revise question are present
statusReason: Task 不存在

[Killed] EqualityOperator
src/domain/store.ts:292:41
   }
 
   private requireTask(id: string): Task {
-    const task = this.tasks.find((t) => t.id === id);
+    const task = this.tasks.find((t) => t.id !== id);
     if (!task) throw new Error("Task 不存在");
     return task;
killedBy: store policy deletes only the target board's files, highlights, tasks, folders and shares
statusReason: Task 不存在

[Killed] ConditionalExpression
src/domain/store.ts:293:9
 
   private requireTask(id: string): Task {
     const task = this.tasks.find((t) => t.id === id);
-    if (!task) throw new Error("Task 不存在");
+    if (true) throw new Error("Task 不存在");
     return task;
   }
killedBy: store policy revises only when both a current file and a revise question are present
statusReason: Task 不存在

[Killed] BooleanLiteral
src/domain/store.ts:293:9
 
   private requireTask(id: string): Task {
     const task = this.tasks.find((t) => t.id === id);
-    if (!task) throw new Error("Task 不存在");
+    if (task) throw new Error("Task 不存在");
     return task;
   }
killedBy: store policy throws the specified missing-entity errors
statusReason: expected [Function] to throw error including 'Task 不存在' but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
src/domain/store.ts:297:48
     return task;
   }
 
-  private selectedSourceFiles(boardId: string) {
-    return this.files.filter((f) => f.boardId === boardId && f.selected && f.kind !== "write");
-  }
+  private selectedSourceFiles(boardId: string) {}
 
   private selectedHighlightsOn(boardId: string) {
killedBy: store policy omits selected write documents from later write sources
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/domain/store.ts:298:37
   }
 
   private selectedSourceFiles(boardId: string) {
-    return this.files.filter((f) => f.boardId === boardId && f.selected && f.kind !== "write");
+    return this.files.filter((f) => true);
   }
 
killedBy: store policy omits selected write documents from later write sources
statusReason: expected [ 'file-xiz2e355-msraf14s', …(1) ] to deeply equal [ 'file-xiz2e355-msraf14s' ]

[Killed] ConditionalExpression
src/domain/store.ts:298:37
   }
 
   private selectedSourceFiles(boardId: string) {
-    return this.files.filter((f) => f.boardId === boardId && f.selected && f.kind !== "write");
+    return this.files.filter((f) => true && f.kind !== "write");
   }
 
killedBy: store policy scopes write sources and chat cites to the current board
statusReason: expected [ 'file-l27dkn4x-msraf1a6', …(1) ] to deeply equal [ 'file-l27dkn4x-msraf1a6' ]

[Killed] BlockStatement
src/domain/store.ts:301:49
     return this.files.filter((f) => f.boardId === boardId && f.selected && f.kind !== "write");
   }
 
-  private selectedHighlightsOn(boardId: string) {
-    return this.highlights.filter((h) => h.boardId === boardId && h.selected);
-  }
+  private selectedHighlightsOn(boardId: string) {}
 
   private reviseOpenDocument(task: Task, question: string, currentFileId: string): ChatMessage {
killedBy: store policy omits selected write documents from later write sources
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] MethodExpression
src/domain/store.ts:302:12
   }
 
   private selectedHighlightsOn(boardId: string) {
-    return this.highlights.filter((h) => h.boardId === boardId && h.selected);
+    return this.highlights;
   }
 
killedBy: store policy scopes write sources and chat cites to the current board
statusReason: expected [ 'hl-z7exqkxz-msraf1nd', …(1) ] to deeply equal [ 'hl-z7exqkxz-msraf1nd' ]

[Killed] LogicalOperator
src/domain/store.ts:302:42
   }
 
   private selectedHighlightsOn(boardId: string) {
-    return this.highlights.filter((h) => h.boardId === boardId && h.selected);
+    return this.highlights.filter((h) => h.boardId === boardId || h.selected);
   }
 
killedBy: store policy scopes write sources and chat cites to the current board
statusReason: expected [ 'hl-zrpw357a-msraf1u0', …(1) ] to deeply equal [ 'hl-zrpw357a-msraf1u0' ]

[Killed] BlockStatement
src/domain/store.ts:305:96
     return this.highlights.filter((h) => h.boardId === boardId && h.selected);
   }
 
-  private reviseOpenDocument(task: Task, question: string, currentFileId: string): ChatMessage {
-    const current = this.requireFile(currentFileId);
-    current.body = applyChatEdit(current, question).body;
-    const assistant: ChatMessage = {
-      id: createId("msg"),
-      role: "assistant",
-      text: `已更新当前文档「${current.title}」，没有另存。`,
-      ranForSeconds: 3,
-      citedFileIds: [current.id],
-    };
-    task.messages.push(assistant);
-    return assistant;
-  }
+  private reviseOpenDocument(task: Task, question: string, currentFileId: string): ChatMessage {}
 
   private replyFromSources(task: Task, question: string): ChatMessage {
killedBy: store policy revises only when both a current file and a revise question are present
statusReason: expected '## 引言\n围绕「主题」展开讨论。\n## 分析\n结合已选材料进行分析…' to contain '修订'
