[Killed] ObjectLiteral
src/domain/store.ts:308:36
   private reviseOpenDocument(task: Task, question: string, currentFileId: string): ChatMessage {
     const current = this.requireFile(currentFileId);
     current.body = applyChatEdit(current, question).body;
-    const assistant: ChatMessage = {
-      id: createId("msg"),
-      role: "assistant",
-      text: `已更新当前文档「${current.title}」，没有另存。`,
-      ranForSeconds: 3,
-      citedFileIds: [current.id],
-    };
+    const assistant: ChatMessage = {};
     task.messages.push(assistant);
     return assistant;
killedBy: store policy revises only when both a current file and a revise question are present
statusReason: expected undefined to be 3 // Object.is equality

[Killed] StringLiteral
src/domain/store.ts:309:20
     const current = this.requireFile(currentFileId);
     current.body = applyChatEdit(current, question).body;
     const assistant: ChatMessage = {
-      id: createId("msg"),
+      id: createId(""),
       role: "assistant",
       text: `已更新当前文档「${current.title}」，没有另存。`,
killedBy: store policy uses prefixed ids and default flags on new records
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/domain/store.ts:319:71
     return assistant;
   }
 
-  private replyFromSources(task: Task, question: string): ChatMessage {
-    const answer = generateChatAnswer(
-      question,
-      this.files.filter((f) => f.boardId === task.boardId && f.selected),
-      this.highlights.filter((h) => h.boardId === task.boardId && h.selected),
-    );
-    const assistant: ChatMessage = {
-      id: createId("msg"),
-      role: "assistant",
-      text: answer.text,
-      ranForSeconds: 5,
-      citedFileIds: answer.citedFileIds,
-      citedHighlightIds: answer.citedHighlightIds,
-    };
-    task.messages.push(assistant);
-    return assistant;
-  }
+  private replyFromSources(task: Task, question: string): ChatMessage {}
 }
 
killedBy: store policy revises only when both a current file and a revise question are present
statusReason: Cannot read properties of undefined (reading 'ranForSeconds')

[Killed] MethodExpression
src/domain/store.ts:322:7
   private replyFromSources(task: Task, question: string): ChatMessage {
     const answer = generateChatAnswer(
       question,
-      this.files.filter((f) => f.boardId === task.boardId && f.selected),
+      this.files,
       this.highlights.filter((h) => h.boardId === task.boardId && h.selected),
     );
killedBy: store policy scopes write sources and chat cites to the current board
statusReason: expected [ 'file-m1eyqkp2-msraf2ab', …(2) ] to deeply equal [ 'file-m1eyqkp2-msraf2ab' ]

[Killed] ConditionalExpression
src/domain/store.ts:322:32
   private replyFromSources(task: Task, question: string): ChatMessage {
     const answer = generateChatAnswer(
       question,
-      this.files.filter((f) => f.boardId === task.boardId && f.selected),
+      this.files.filter((f) => false),
       this.highlights.filter((h) => h.boardId === task.boardId && h.selected),
     );
killedBy: store policy scopes write sources and chat cites to the current board
statusReason: expected [] to deeply equal [ 'file-6le9lpju-msraf2er' ]

[Killed] ConditionalExpression
src/domain/store.ts:323:37
     const answer = generateChatAnswer(
       question,
       this.files.filter((f) => f.boardId === task.boardId && f.selected),
-      this.highlights.filter((h) => h.boardId === task.boardId && h.selected),
+      this.highlights.filter((h) => false),
     );
     const assistant: ChatMessage = {
killedBy: store policy scopes write sources and chat cites to the current board
statusReason: expected [] to deeply equal [ 'hl-ty53brf7-msraf2qx' ]

[Killed] ConditionalExpression
src/domain/store.ts:323:37
     const answer = generateChatAnswer(
       question,
       this.files.filter((f) => f.boardId === task.boardId && f.selected),
-      this.highlights.filter((h) => h.boardId === task.boardId && h.selected),
+      this.highlights.filter((h) => true),
     );
     const assistant: ChatMessage = {
killedBy: store policy scopes write sources and chat cites to the current board
statusReason: expected [ 'hl-npysw78x-msraf2ov', …(1) ] to deeply equal [ 'hl-npysw78x-msraf2ov' ]

[Killed] BlockStatement
src/domain/store.ts:338:52
   }
 }
 
-function attachMediaTranscript(file: MaterialFile) {
-  if (file.kind === "audio" || file.kind === "video") {
-    file.transcription = fakeTranscription(file);
-  }
-  return file;
-}
+function attachMediaTranscript(file: MaterialFile) {}
 
 function assignDefined<T extends object>(target: T, patch: Partial<T>) {
killedBy: store policy attaches transcripts only to audio and video
statusReason: Cannot read properties of undefined (reading 'transcription')

[Killed] LogicalOperator
src/domain/store.ts:339:7
 }
 
 function attachMediaTranscript(file: MaterialFile) {
-  if (file.kind === "audio" || file.kind === "video") {
+  if (file.kind === "audio" && file.kind === "video") {
     file.transcription = fakeTranscription(file);
   }
killedBy: store policy attaches transcripts only to audio and video
statusReason: expected undefined to be 'success' // Object.is equality

[Killed] ConditionalExpression
src/domain/store.ts:339:7
 }
 
 function attachMediaTranscript(file: MaterialFile) {
-  if (file.kind === "audio" || file.kind === "video") {
+  if (false) {
     file.transcription = fakeTranscription(file);
   }
killedBy: store policy attaches transcripts only to audio and video
statusReason: expected undefined to be 'success' // Object.is equality

[Killed] BlockStatement
src/domain/store.ts:345:72
   return file;
 }
 
-function assignDefined<T extends object>(target: T, patch: Partial<T>) {
-  (Object.keys(patch) as (keyof T)[]).forEach((key) => {
-    const value = patch[key];
-    if (value !== undefined) {
-      target[key] = value as T[keyof T];
-    }
-  });
-}
+function assignDefined<T extends object>(target: T, patch: Partial<T>) {}
 
killedBy: store policy assignDefined writes empty strings and false, but skips undefined
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/domain/store.ts:346:56
 }
 
 function assignDefined<T extends object>(target: T, patch: Partial<T>) {
-  (Object.keys(patch) as (keyof T)[]).forEach((key) => {
-    const value = patch[key];
-    if (value !== undefined) {
-      target[key] = value as T[keyof T];
-    }
-  });
+  (Object.keys(patch) as (keyof T)[]).forEach((key) => {});
 }
 
killedBy: store policy assignDefined writes empty strings and false, but skips undefined
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/domain/store.ts:348:9
 function assignDefined<T extends object>(target: T, patch: Partial<T>) {
   (Object.keys(patch) as (keyof T)[]).forEach((key) => {
     const value = patch[key];
-    if (value !== undefined) {
+    if (true) {
       target[key] = value as T[keyof T];
     }
killedBy: store policy assignDefined writes empty strings and false, but skips undefined
statusReason: expected undefined to be '标题' // Object.is equality

[Killed] EqualityOperator
src/domain/store.ts:348:9
 function assignDefined<T extends object>(target: T, patch: Partial<T>) {
   (Object.keys(patch) as (keyof T)[]).forEach((key) => {
     const value = patch[key];
-    if (value !== undefined) {
+    if (value === undefined) {
       target[key] = value as T[keyof T];
     }
killedBy: store policy assignDefined writes empty strings and false, but skips undefined
statusReason: expected undefined to be '标题' // Object.is equality
