[Killed] StringLiteral
src/domain/write-templates.ts:3:44
 import type { Highlight, MaterialFile, WriteGenre } from "./types";
 
-export const WRITE_GENRES: WriteGenre[] = ["长文", "短文提纲", "小红书图文", "口播稿"];
+export const WRITE_GENRES: WriteGenre[] = ["", "短文提纲", "小红书图文", "口播稿"];
 
 export function topicFrom(files: MaterialFile[], highlights: Highlight[]): string {
killedBy: write templates exposes the four Chinese genre names in order
statusReason: expected [ '', '短文提纲', '小红书图文', '口播稿' ] to deeply equal [ '长文', '短文提纲', '小红书图文', '口播稿' ]

[Killed] BlockStatement
src/domain/write-templates.ts:5:83
 
 export const WRITE_GENRES: WriteGenre[] = ["长文", "短文提纲", "小红书图文", "口播稿"];
 
-export function topicFrom(files: MaterialFile[], highlights: Highlight[]): string {
-  return files[0]?.title || highlights[0]?.text || "主题";
-}
+export function topicFrom(files: MaterialFile[], highlights: Highlight[]): string {}
 
 function writeLongform(topic: string, fileTitles: string[], highlightTexts: string[]) {
killedBy: domain invariants never lets one write overwrite another, including the same genre twice
statusReason: Property failed after 1 tests
{ seed: 872692151, path: "0:1:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: ["小红书图文","长文","!"]
Shrunk 9 time(s)
Got TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] ConditionalExpression
src/domain/write-templates.ts:6:10
 export const WRITE_GENRES: WriteGenre[] = ["长文", "短文提纲", "小红书图文", "口播稿"];
 
 export function topicFrom(files: MaterialFile[], highlights: Highlight[]): string {
-  return files[0]?.title || highlights[0]?.text || "主题";
+  return false;
 }
 
killedBy: domain invariants never lets one write overwrite another, including the same genre twice
statusReason: Property failed after 1 tests
{ seed: -1256104878, path: "0:0:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: ["长文","小红书图文","!"]
Shrunk 8 time(s)
Got TypeError: topic.replace is not a function

[Killed] ConditionalExpression
src/domain/write-templates.ts:6:10
 export const WRITE_GENRES: WriteGenre[] = ["长文", "短文提纲", "小红书图文", "口播稿"];
 
 export function topicFrom(files: MaterialFile[], highlights: Highlight[]): string {
-  return files[0]?.title || highlights[0]?.text || "主题";
+  return false || "主题";
 }
 
killedBy: snapshot and copy helpers detects revise questions and topics
statusReason: expected '主题' to be '甲' // Object.is equality

[Killed] BlockStatement
src/domain/write-templates.ts:9:87
   return files[0]?.title || highlights[0]?.text || "主题";
 }
 
-function writeLongform(topic: string, fileTitles: string[], highlightTexts: string[]) {
-  const analysis = highlightTexts.length
-    ? `摘录要点：${highlightTexts.join("；")}`
-    : `结合已选材料进行分析。`;
-  return {
-    title: `关于「${topic}」的长文`,
-    body: [
-      `## 引言`,
-      `围绕「${topic}」展开讨论。`,
-      `## 分析`,
-      analysis,
-      `## 结论`,
-      `以上基于所选材料整理而成。`,
-      ``,
-      `来源：`,
-      ...fileTitles.map((t) => `- ${t}`),
-      ...highlightTexts.map((t) => `- 高亮：${t}`),
-    ].join("\n"),
-  };
-}
+function writeLongform(topic: string, fileTitles: string[], highlightTexts: string[]) {}
 
 function writeOutline(topic: string, _fileTitles: string[], highlightTexts: string[]) {
killedBy: domain invariants never lets one write overwrite another, including the same genre twice
statusReason: Property failed after 4 tests
{ seed: 264436868, path: "3:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["长文","长文","!"]
Shrunk 8 time(s)
Got TypeError: Cannot read properties of undefined (reading 'title')

[Killed] StringLiteral
src/domain/write-templates.ts:11:35
 
 function writeLongform(topic: string, fileTitles: string[], highlightTexts: string[]) {
   const analysis = highlightTexts.length
-    ? `摘录要点：${highlightTexts.join("；")}`
+    ? `摘录要点：${highlightTexts.join("")}`
     : `结合已选材料进行分析。`;
   return {
killedBy: write templates renders 长文 with sections, analysis fallback, and sources
statusReason: expected { title: '关于「甲」的长文', …(1) } to deeply equal { title: '关于「甲」的长文', …(1) }

[Killed] StringLiteral
src/domain/write-templates.ts:20:7
       `围绕「${topic}」展开讨论。`,
       `## 分析`,
       analysis,
-      `## 结论`,
+      ``,
       `以上基于所选材料整理而成。`,
       ``,
killedBy: write templates renders 长文 with sections, analysis fallback, and sources
statusReason: expected { title: '关于「甲」的长文', …(1) } to deeply equal { title: '关于「甲」的长文', …(1) }

[Killed] ArrowFunction
src/domain/write-templates.ts:24:25
       `以上基于所选材料整理而成。`,
       ``,
       `来源：`,
-      ...fileTitles.map((t) => `- ${t}`),
+      ...fileTitles.map(() => undefined),
       ...highlightTexts.map((t) => `- 高亮：${t}`),
     ].join("\n"),
killedBy: write templates renders 长文 with sections, analysis fallback, and sources
statusReason: expected { title: '关于「甲」的长文', …(1) } to deeply equal { title: '关于「甲」的长文', …(1) }

[Killed] ArrowFunction
src/domain/write-templates.ts:25:29
       ``,
       `来源：`,
       ...fileTitles.map((t) => `- ${t}`),
-      ...highlightTexts.map((t) => `- 高亮：${t}`),
+      ...highlightTexts.map(() => undefined),
     ].join("\n"),
   };
killedBy: write templates renders 长文 with sections, analysis fallback, and sources
statusReason: expected { title: '关于「甲」的长文', …(1) } to deeply equal { title: '关于「甲」的长文', …(1) }

[Killed] BlockStatement
src/domain/write-templates.ts:30:87
   };
 }
 
-function writeOutline(topic: string, _fileTitles: string[], highlightTexts: string[]) {
-  return {
-    title: `${topic} · 短文提纲`,
-    body: [
-      `主题：${topic}`,
-      `- 背景`,
-      `  - 这段写什么：交代「${topic}」从何而来`,
-      `- 核心观点`,
-      `  - 这段写什么：${highlightTexts[0] || "说明主论点"}`,
-      `- 收束`,
-      `  - 这段写什么：给出下一步`,
-    ].join("\n"),
-  };
-}
+function writeOutline(topic: string, _fileTitles: string[], highlightTexts: string[]) {}
 
 function writeXhs(topic: string, _fileTitles: string[], highlightTexts: string[]) {
killedBy: write templates renders 短文提纲 as nested bullets with a highlight or default point
statusReason: expected undefined to deeply equal { title: '甲 · 短文提纲', …(1) }

[Killed] ObjectLiteral
src/domain/write-templates.ts:31:10
 }
 
 function writeOutline(topic: string, _fileTitles: string[], highlightTexts: string[]) {
-  return {
-    title: `${topic} · 短文提纲`,
-    body: [
-      `主题：${topic}`,
-      `- 背景`,
-      `  - 这段写什么：交代「${topic}」从何而来`,
-      `- 核心观点`,
-      `  - 这段写什么：${highlightTexts[0] || "说明主论点"}`,
-      `- 收束`,
-      `  - 这段写什么：给出下一步`,
-    ].join("\n"),
-  };
+  return {};
 }
 
killedBy: write templates renders 短文提纲 as nested bullets with a highlight or default point
statusReason: expected {} to deeply equal { title: '甲 · 短文提纲', …(1) }

[Killed] StringLiteral
src/domain/write-templates.ts:35:7
     title: `${topic} · 短文提纲`,
     body: [
       `主题：${topic}`,
-      `- 背景`,
+      ``,
       `  - 这段写什么：交代「${topic}」从何而来`,
       `- 核心观点`,
killedBy: write templates renders 短文提纲 as nested bullets with a highlight or default point
statusReason: expected { title: '甲 · 短文提纲', …(1) } to deeply equal { title: '甲 · 短文提纲', …(1) }

[Killed] ConditionalExpression
src/domain/write-templates.ts:38:20
       `- 背景`,
       `  - 这段写什么：交代「${topic}」从何而来`,
       `- 核心观点`,
-      `  - 这段写什么：${highlightTexts[0] || "说明主论点"}`,
+      `  - 这段写什么：${true}`,
       `- 收束`,
       `  - 这段写什么：给出下一步`,
killedBy: write templates renders 短文提纲 as nested bullets with a highlight or default point
statusReason: expected { title: '甲 · 短文提纲', …(1) } to deeply equal { title: '甲 · 短文提纲', …(1) }

[Killed] LogicalOperator
src/domain/write-templates.ts:38:20
       `- 背景`,
       `  - 这段写什么：交代「${topic}」从何而来`,
       `- 核心观点`,
-      `  - 这段写什么：${highlightTexts[0] || "说明主论点"}`,
+      `  - 这段写什么：${highlightTexts[0] && "说明主论点"}`,
       `- 收束`,
       `  - 这段写什么：给出下一步`,
killedBy: write templates renders 短文提纲 as nested bullets with a highlight or default point
statusReason: expected { title: '甲 · 短文提纲', …(1) } to deeply equal { title: '甲 · 短文提纲', …(1) }

[Killed] StringLiteral
src/domain/write-templates.ts:39:7
       `  - 这段写什么：交代「${topic}」从何而来`,
       `- 核心观点`,
       `  - 这段写什么：${highlightTexts[0] || "说明主论点"}`,
-      `- 收束`,
+      ``,
       `  - 这段写什么：给出下一步`,
     ].join("\n"),
killedBy: write templates renders 短文提纲 as nested bullets with a highlight or default point
statusReason: expected { title: '甲 · 短文提纲', …(1) } to deeply equal { title: '甲 · 短文提纲', …(1) }

[Killed] BlockStatement
src/domain/write-templates.ts:45:83
   };
 }
 
-function writeXhs(topic: string, _fileTitles: string[], highlightTexts: string[]) {
-  return {
-    title: `${topic}怎么看`,
-    body: [
-      `先记住这一点。`,
-      `步骤一：抓住「${topic}」的核心。`,
-      `对比：有材料时更清楚，没有则容易散。`,
-      highlightTexts[0] ? `摘一句：${highlightTexts[0]}` : "",
-      ``,
-      `#${topic.replace(/\s+/g, "")} #知识管理 #稿台笔记`,
-      `建议配图：封面用一句短标题即可`,
-    ]
-      .filter(Boolean)
-      .join("\n"),
-  };
-}
+function writeXhs(topic: string, _fileTitles: string[], highlightTexts: string[]) {}
 
 function writeScript(topic: string, _fileTitles: string[], highlightTexts: string[]) {
killedBy: write templates renders 小红书图文 with tags, optional quote, and no empty lines from missing highlights
statusReason: expected undefined to deeply equal { title: '知识 管理怎么看', …(1) }

[Killed] StringLiteral
src/domain/write-templates.ts:47:12
 
 function writeXhs(topic: string, _fileTitles: string[], highlightTexts: string[]) {
   return {
-    title: `${topic}怎么看`,
+    title: ``,
     body: [
       `先记住这一点。`,
killedBy: write templates renders 小红书图文 with tags, optional quote, and no empty lines from missing highlights
statusReason: expected { title: '', …(1) } to deeply equal { title: '知识 管理怎么看', …(1) }

[Killed] MethodExpression
src/domain/write-templates.ts:48:11
 function writeXhs(topic: string, _fileTitles: string[], highlightTexts: string[]) {
   return {
     title: `${topic}怎么看`,
-    body: [
-      `先记住这一点。`,
-      `步骤一：抓住「${topic}」的核心。`,
-      `对比：有材料时更清楚，没有则容易散。`,
-      highlightTexts[0] ? `摘一句：${highlightTexts[0]}` : "",
-      ``,
-      `#${topic.replace(/\s+/g, "")} #知识管理 #稿台笔记`,
-      `建议配图：封面用一句短标题即可`,
-    ]
-      .filter(Boolean)
+    body: [`先记住这一点。`, `步骤一：抓住「${topic}」的核心。`, `对比：有材料时更清楚，没有则容易散。`, highlightTexts[0] ? `摘一句：${highlightTexts[0]}` : "", ``, `#${topic.replace(/\s+/g, "")} #知识管理 #稿台笔记`, `建议配图：封面用一句短标题即可`]
       .join("\n"),
   };
killedBy: write templates renders 小红书图文 with tags, optional quote, and no empty lines from missing highlights
statusReason: expected { title: '知识 管理怎么看', …(1) } to deeply equal { title: '知识 管理怎么看', …(1) }

[Killed] StringLiteral
src/domain/write-templates.ts:51:7
     body: [
       `先记住这一点。`,
       `步骤一：抓住「${topic}」的核心。`,
-      `对比：有材料时更清楚，没有则容易散。`,
+      ``,
       highlightTexts[0] ? `摘一句：${highlightTexts[0]}` : "",
       ``,
killedBy: write templates renders 小红书图文 with tags, optional quote, and no empty lines from missing highlights
statusReason: expected { title: '知识 管理怎么看', …(1) } to deeply equal { title: '知识 管理怎么看', …(1) }

[Killed] StringLiteral
src/domain/write-templates.ts:52:27
       `先记住这一点。`,
       `步骤一：抓住「${topic}」的核心。`,
       `对比：有材料时更清楚，没有则容易散。`,
-      highlightTexts[0] ? `摘一句：${highlightTexts[0]}` : "",
+      highlightTexts[0] ? `` : "",
       ``,
       `#${topic.replace(/\s+/g, "")} #知识管理 #稿台笔记`,
killedBy: write templates renders 小红书图文 with tags, optional quote, and no empty lines from missing highlights
statusReason: expected { title: '知识 管理怎么看', …(1) } to deeply equal { title: '知识 管理怎么看', …(1) }

[Killed] StringLiteral
src/domain/write-templates.ts:53:7
       `步骤一：抓住「${topic}」的核心。`,
       `对比：有材料时更清楚，没有则容易散。`,
       highlightTexts[0] ? `摘一句：${highlightTexts[0]}` : "",
-      ``,
+      `Stryker was here!`,
       `#${topic.replace(/\s+/g, "")} #知识管理 #稿台笔记`,
       `建议配图：封面用一句短标题即可`,
killedBy: write templates renders 小红书图文 with tags, optional quote, and no empty lines from missing highlights
statusReason: expected { title: '知识 管理怎么看', …(1) } to deeply equal { title: '知识 管理怎么看', …(1) }

[Killed] StringLiteral
src/domain/write-templates.ts:54:33
       `对比：有材料时更清楚，没有则容易散。`,
       highlightTexts[0] ? `摘一句：${highlightTexts[0]}` : "",
       ``,
-      `#${topic.replace(/\s+/g, "")} #知识管理 #稿台笔记`,
+      `#${topic.replace(/\s+/g, "Stryker was here!")} #知识管理 #稿台笔记`,
       `建议配图：封面用一句短标题即可`,
     ]
killedBy: write templates renders 小红书图文 with tags, optional quote, and no empty lines from missing highlights
statusReason: expected { title: '知识 管理怎么看', …(1) } to deeply equal { title: '知识 管理怎么看', …(1) }

[Killed] StringLiteral
src/domain/write-templates.ts:54:7
       `对比：有材料时更清楚，没有则容易散。`,
       highlightTexts[0] ? `摘一句：${highlightTexts[0]}` : "",
       ``,
-      `#${topic.replace(/\s+/g, "")} #知识管理 #稿台笔记`,
+      ``,
       `建议配图：封面用一句短标题即可`,
     ]
killedBy: write templates renders 小红书图文 with tags, optional quote, and no empty lines from missing highlights
statusReason: expected { title: '知识 管理怎么看', …(1) } to deeply equal { title: '知识 管理怎么看', …(1) }

[Killed] BlockStatement
src/domain/write-templates.ts:62:86
   };
 }
 
-function writeScript(topic: string, _fileTitles: string[], highlightTexts: string[]) {
-  const pointTwo = highlightTexts[0]
-    ? `第二点，材料里提到：${highlightTexts[0]}`
-    : `第二点，用一个例子落地。`;
-  return {
-    title: `${topic} · 口播稿`,
-    body: [
-      `【开场钩子】`,
-      `今天只讲一件事：${topic}。`,
-      `【展开点 1】`,
-      `第一点，先把概念说清楚。`,
-      `【展开点 2】`,
-      pointTwo,
-      `【展开点 3】`,
-      `第三点，告诉听众可以马上做什么。`,
-      `【收束】`,
-      `记住：从材料出发，再开口。`,
-    ].join("\n"),
-  };
-}
+function writeScript(topic: string, _fileTitles: string[], highlightTexts: string[]) {}
 
 const WRITE_TEMPLATES: Record<WriteGenre, (topic: string, fileTitles: string[], highlightTexts: string[]) => { title: string; body: string }> = {
killedBy: domain invariants never lets one write overwrite another, including the same genre twice
statusReason: Property failed after 3 tests
{ seed: 71525740, path: "2:0:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: ["长文","口播稿","!"]
Shrunk 8 time(s)
Got TypeError: Cannot read properties of undefined (reading 'title')

[Killed] ObjectLiteral
src/domain/write-templates.ts:66:10
   const pointTwo = highlightTexts[0]
     ? `第二点，材料里提到：${highlightTexts[0]}`
     : `第二点，用一个例子落地。`;
-  return {
-    title: `${topic} · 口播稿`,
-    body: [
-      `【开场钩子】`,
-      `今天只讲一件事：${topic}。`,
-      `【展开点 1】`,
-      `第一点，先把概念说清楚。`,
-      `【展开点 2】`,
-      pointTwo,
-      `【展开点 3】`,
-      `第三点，告诉听众可以马上做什么。`,
-      `【收束】`,
-      `记住：从材料出发，再开口。`,
-    ].join("\n"),
-  };
+  return {};
 }
 
killedBy: domain invariants copies genre documents as title plus the required body fields
statusReason: Property failed after 1 tests
{ seed: -425053541, path: "0:1:1", endOnFailure: true }
Counterexample: ["口播稿","!"]
Shrunk 2 time(s)
Got AssertionError: expected -1 to be less than -1

[Killed] StringLiteral
src/domain/write-templates.ts:67:12
     ? `第二点，材料里提到：${highlightTexts[0]}`
     : `第二点，用一个例子落地。`;
   return {
-    title: `${topic} · 口播稿`,
+    title: ``,
     body: [
       `【开场钩子】`,
killedBy: write templates renders 口播稿 with three points and a highlight or example fallback
statusReason: expected { title: '', …(1) } to deeply equal { title: '甲 · 口播稿', …(1) }

[Killed] StringLiteral
src/domain/write-templates.ts:73:7
       `今天只讲一件事：${topic}。`,
       `【展开点 1】`,
       `第一点，先把概念说清楚。`,
-      `【展开点 2】`,
+      ``,
       pointTwo,
       `【展开点 3】`,
killedBy: write templates renders 口播稿 with three points and a highlight or example fallback
statusReason: expected { title: '甲 · 口播稿', …(1) } to deeply equal { title: '甲 · 口播稿', …(1) }

[Killed] StringLiteral
src/domain/write-templates.ts:77:7
       pointTwo,
       `【展开点 3】`,
       `第三点，告诉听众可以马上做什么。`,
-      `【收束】`,
+      ``,
       `记住：从材料出发，再开口。`,
     ].join("\n"),
killedBy: write templates renders 口播稿 with three points and a highlight or example fallback
statusReason: expected { title: '甲 · 口播稿', …(1) } to deeply equal { title: '甲 · 口播稿', …(1) }

[Killed] BlockStatement
src/domain/write-templates.ts:94:36
   genre: WriteGenre,
   files: MaterialFile[],
   highlights: Highlight[],
-): { title: string; body: string } {
-  const topic = topicFrom(files, highlights);
-  return WRITE_TEMPLATES[genre](topic, files.map((f) => f.title), highlights.map((h) => h.text));
-}
+): { title: string; body: string } {}
 
killedBy: write templates renders 长文 with sections, analysis fallback, and sources
statusReason: expected undefined to deeply equal { title: '关于「甲」的长文', …(1) }

[Killed] ArrowFunction
src/domain/write-templates.ts:96:50
   highlights: Highlight[],
 ): { title: string; body: string } {
   const topic = topicFrom(files, highlights);
-  return WRITE_TEMPLATES[genre](topic, files.map((f) => f.title), highlights.map((h) => h.text));
+  return WRITE_TEMPLATES[genre](topic, files.map(() => undefined), highlights.map((h) => h.text));
 }
 
killedBy: write templates renders 长文 with sections, analysis fallback, and sources
statusReason: expected { title: '关于「甲」的长文', …(1) } to deeply equal { title: '关于「甲」的长文', …(1) }

[Killed] ArrowFunction
src/domain/write-templates.ts:96:82
   highlights: Highlight[],
 ): { title: string; body: string } {
   const topic = topicFrom(files, highlights);
-  return WRITE_TEMPLATES[genre](topic, files.map((f) => f.title), highlights.map((h) => h.text));
+  return WRITE_TEMPLATES[genre](topic, files.map((f) => f.title), highlights.map(() => undefined));
 }
 
killedBy: write templates renders 长文 with sections, analysis fallback, and sources
statusReason: expected { title: '关于「甲」的长文', …(1) } to deeply equal { title: '关于「甲」的长文', …(1) }
